{
  "projects": [
    {
      "Title": "Airships",
      "BodyContent": "One passion of mine since 2010 has been Minecraft. I find it's a neat medium for voxel modeling and leaves some room for the imagination. It's also cheaper than legos. I got to lead a team of like-minded builders making a hub world for a server we played on, and other than learning the ropes of project planning and managing a group of folks, I got to do a bit of concept work as well!<br><br>We went with a steampunk theme, and I really liked the idea of building airships! I enjoyed thinking about how an airship might function and how to represent those functions while constrained by Minecraft's palette of blocks. I also did a bit of worldbuilding, thinking about parts that might be standardized by my imaginary manufacturer, WDI, and making ships that were modified to fit different needs. If there's one thing I'm the happiest about, it's that all the layers and spaces bleed into each other vertically. It's not like there just a main level and then a level above or below that, but they just flow nicely and moving through them in-game felt claustrophobic but fluid, which I imagine would fit the constraints of a vessel that needs to keep itself in the air. I've added interactive views of each one below! You can use your mouse to navigate around the models or click on the annotations to view specific areas that I marked, from things like the rudder to the helm!<br>\n<hr>\n<b>WDI Archon</b><br>\nThe Archon was my first airship design. that I made before working on the build mentioned above, so you could say it was basically my prototype. I designed it as a military/anti-piracy vessel, so the hull's been reinforced with dark brown armor plates and plenty of mounted weapons. Additionally, the hold has been hollowed out to make room for a deployable strike craft ornithopter.<br><br>\n    <iframe width=\"690\" height=\"388\" src=\"https://sketchfab.com/models/a4364e48fd594eff982a2a4ee8d67708/embed\" frameborder=\"0\" allowvr=\"\" allowfullscreen=\"\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\" onmousewheel=\"\"></iframe><hr>\n<b>WDI Leviathan</b><br>\nThe Leviathan was my second airship, this time designed as a merchant vessel built off of the same frame as the Archon, and I imagine that the Archon was just a militarized version of the Leviathan rather than the other way around. It features a larger hold and landing skids, and felt a lot more open than the Archon's armored walkways.<br><br>\n<iframe width=\"690\" height=\"388\" src=\"https://sketchfab.com/models/c705fe53e2c34de3940760434e66684b/embed\" frameborder=\"0\" allowvr=\"\" allowfullscreen=\"\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\" onmousewheel=\"\"></iframe>\n<hr>\n<b>Penzance's Plunder</b><br>\nThe Penzance's Plunder I designed as a pirate vessel, and it's sleeker profile and two large propellers instead of one drive prop and two steering props show that the vessel was designed for speed, what might have once been a racing vessel converted to blockade running. It's been armed but not armored, with a large anti-aircraft gun in the front being its main armament and grappling ballistas being on each side to aid in boarding activities. I also didn't imagine the pirates would be docking it often, so it features a ladder that can drop down for boarding.<br><br>\n    <iframe width=\"690\" height=\"388\" src=\"https://sketchfab.com/models/06ba56072c2f423895ddbe381a1abff6/embed\" frameborder=\"0\" allowvr=\"\" allowfullscreen=\"\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\" onmousewheel=\"\"></iframe><hr>\n<b>WDI Life Boat</b><br>\nThe WDI Life Boat was the largest airship I built, and served an actual purpose for the server being a venue for so-called \"drop parties\" where people would drop free items while the rest of the server ran around on the deck below trying to pick up free and often valuable goodies. With this in mind, I was going for the look of a pleasure craft but building around the large main deck. With that in mind, it has many indoor and outdoor observation decks, with some fully enclosed by glass to help get out of the choppy winds outdoors. For a ship as large as it is, it features extra propulsion with the engines from the Penzance's Plunder being relegated to merely steering propellers. As seemed fitting to a party vessel, the main balloon was instead turned into colorful smaller balloons, not just to resemble party balloons but to have redundancy in case there were to be damage.<br><br>\n    <iframe width=\"690\" height=\"388\" src=\"https://sketchfab.com/models/820cc3c290964831b4c5607838ded2ba/embed\" frameborder=\"0\" allowvr=\"\" allowfullscreen=\"\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\" onmousewheel=\"\"></iframe><hr>\n<b>WDI Waftsail</b><br>\nIn a world with all of these large crewed airships, what would a small commuter airship look like? That's the line of thinking that led me to build the WDI Waftsail. While smaller than the other airships, care was still taken in imagining how it would function. It has a lot of the same \"hardware\" as its larger companions, just scaled down. I also figured that if there were a bunch of these in production, emphasis would be placed on the colors and patterning of the balloons, buth in order to differentiate them but also because owners would probably want to pick from the colors and patterns to find one they'd enjoy most! \n    <iframe width=\"690\" height=\"388\" src=\"https://sketchfab.com/models/86d5c29eb77341ee8635767d7ff1a2db/embed\" frameborder=\"0\" allowvr=\"\" allowfullscreen=\"\" mozallowfullscreen=\"true\" webkitallowfullscreen=\"true\" onmousewheel=\"\"></iframe>",
      "Timeframe": {
        "Sortable": "2016-12-01",
        "Display": "Winter 2016"
      },
      "Description": "Airships used in a Minecraft Server's hub world",
      "ThumbnailImage": "images/as.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "3D Modelling",
        "Gaming"
      ],
      "Images": [],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Arches",
      "BodyContent": "Arches were the final result of what was called the Tool Project. We started by being assigned a simple hand tool and we had to become really familiar with it. We drafted it, studied and drew its movement, and imagined how the section cut of the tool would change in the motions of being used. After that , we were paired up with another student and merged our motions to create a form.<br><br>My tool was a tortilla press, and my partner's tool was a knife sharpener. The end model had elements reflecting the hinging over time and the heaviness of the tortilla press, but also elements of repetition and cutting from the knife sharpener. The model in its many iterations focused on light and space, with two spaces under a shared roof divided by cutting vertical slats.<br><br>The big takeaway from this project was working with another individual on a high-stakes project. While the Building Study project had us working together in a group of three, this project was working on something original, and I think we made the mistake of not playing to each other's strengths. Vincent is a great designer and my specialty is in the fabrication, but I think in trying to find compromise we ended up with something neither of us was too happy with.<br><br>That being said, I do appreciate the drawings I made as part of this project, and I also pushed my renders to a higher level than before. On a previous iteration of my portfolio website, I actually used these renders as the header and footer of the website, and I think the renders really leverage the strengths of the architecture.",
      "Timeframe": {
        "Sortable": "2017-01-01",
        "Display": "Spring 2017"
      },
      "Description": "A pavilion derived from a tortilla press and a knife sharpener",
      "ThumbnailImage": "images/arc.thumbnail.jpg",
      "Collaborators": [
        {
          "Name": "Vincent DeRienzo",
          "Role": ""
        }
      ],
      "Tags": [
        "Architecture",
        "Studio",
        "Woodworking"
      ],
      "Images": [
        {
          "ImageURL": "images/arc.1.jpg",
          "Description": "An overview of the final model."
        },
        {
          "ImageURL": "images/arc.2.jpg",
          "Description": "An interior view of the model showcasing the light through the slats."
        },
        {
          "ImageURL": "images/arc.3.jpg",
          "Description": "A view of the entrance to the model."
        },
        {
          "ImageURL": "images/arc.4.jpg",
          "Description": "An overhead view of the model."
        },
        {
          "ImageURL": "images/arc.5.png",
          "Description": "An eyecatching render of the lighting."
        },
        {
          "ImageURL": "images/arc.6.jpg",
          "Description": "An atmospheric render of the pavilion with an almost post-apocalyptic sky."
        },
        {
          "ImageURL": "images/arc.7.gif",
          "Description": "A render of the lighting throughout the day."
        },
        {
          "ImageURL": "images/arc.8.png",
          "Description": "Drawings to inform construction of the scale model."
        },
        {
          "ImageURL": "images/arc.9.png",
          "Description": "Hand draft of the tortilla press."
        },
        {
          "ImageURL": "images/arc.10.png",
          "Description": "Hand draft of the press's motion while in use."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Saco Lake Bathhouse",
      "BodyContent": "This project was a wellness center that included pools for bathing accommodating both shallow and deep water, saunas, an area for yoga and meditation situated near Saco Lake, New Hampshire. The project demanded we be mindful of the interplay between the site and the bathhouse, as well as considering mindfulness and atmosphere.\n<br><br>\nI envisioned the heavily forested site could have unique play with the trees surrounding it, and could fade into the background by imitating the trees around it. To separate those coming to the bathhouse to utilize its facilities from those who just wanted to hike in and take in the view, I designed the structure to have two concentric staircases, one of which was accessible from the inside of the building while the other was accessible from outside. Hikers could access a lower observation deck while those who went through the changing rooms, baths, and saunas could access a rooftop observation deck, which also maintains the privacy of those utilizing the rooftop for meditation or yoga.\n<br><br>\nDuring this project, I tried experimenting with a different method of rendering with overlaid colors and gradients. It was a style I had seen utilized by Studio SHAFT in their Monogatari series for background shots and I liked how they turned out. Instead of focusing too hard on realism, I think they were able to emphasize the atmosphere I was going for. You enter into a dark and cramped space, you bathe in the dark and then enter into verticality, into the light. I also got to utilize digital fabrication, with one of the stairs being 3D printed, the other print unfortunately refusing to cooperate before the deadline. I also chopped my file up for laser cutting to great effect, especially with the site model.\n<br><br>\nI'm glad that I got to try a lot of new things in the project, and I'm still really happy with the way the site model, building drawings, and renders turned out! While the model itself still left room for improvement, I played an important role in me utilizing digital fabrication technologies more! I only wish tree supports had been common then, and it's surprising that nobody at university taught me about deburring tools until I learned machining.",
      "Timeframe": {
        "Sortable": "2018-03-01",
        "Display": "Spring 2018"
      },
      "Description": "A bathhouse overlooking Saco Lake",
      "ThumbnailImage": "images/bh.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Architecture",
        "Studio",
        "Big Builds"
      ],
      "Images": [
        {
          "ImageURL": "images/bh.1.jpg",
          "Description": "My combined plan and section drawings of the bathhouse."
        },
        {
          "ImageURL": "images/bh.2.jpg",
          "Description": "The approach to the bathhouse."
        },
        {
          "ImageURL": "images/bh.3.jpg",
          "Description": "Entering the bathhouse."
        },
        {
          "ImageURL": "images/bh.4.jpg",
          "Description": "Inside the pools."
        },
        {
          "ImageURL": "images/bh.5.jpg",
          "Description": "Resting on the roof of the bathhouse."
        },
        {
          "ImageURL": "images/bh.6.jpg",
          "Description": "Gazing at the night sky from the stairs."
        },
        {
          "ImageURL": "images/bh.7.jpg",
          "Description": "A detail model focused on the entrance to the bathhouse."
        },
        {
          "ImageURL": "images/bh.8.jpg",
          "Description": "A detail model focused on the entrance to the bathhouse."
        },
        {
          "ImageURL": "images/bh.9.jpg",
          "Description": "A scale model of the entire bathhouse."
        },
        {
          "ImageURL": "images/bh.10.jpg",
          "Description": "A close-up view of the two observation decks. Note the 3D printed stair."
        },
        {
          "ImageURL": "images/bh.11.jpg",
          "Description": "A view of the stairs and one of the sauna entrances."
        },
        {
          "ImageURL": "images/bh.12.jpg",
          "Description": "A site plan of the lake, nearby roads, and the bathhouse."
        },
        {
          "ImageURL": "images/bh.13.jpg",
          "Description": "A close-up of the bathhouse on the site plan."
        },
        {
          "ImageURL": "images/bh.14.jpg",
          "Description": "My print for the two staircases. After this I learned a whole lot about 3D printing and supports, but too late for the results to make it into my model."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Building Study",
      "BodyContent": "<p>Architecture has been around for a while now, and architecture of the past has a lot to teach us today. In this project, our group was assigned to get really familiar with an architectural precedent. Our group was assigned the Fredensborg Houses by Jorn Utzon. The project involved getting familiar with the buildings, knowing the measurements and ideas behind them, and finally culminated in a scale model of the buildings and site. Since the Fredensborg Houses are a housing project, the three of us focused on three houses on the east end of the site.<br><br>As a group we had to construct the site model and each of us made our own model of the house, although each individual made their own set of drafts. I had a lot of fun with the drafts, since it was very satisfying when all the lines intersected perfectly, which took a lot of trust in yourself and in the process. Plus, the heavy-weight Strathmore paper we used wasn't cheap, especially for a student.<br><br>However, the part that I found the most enjoyable was making the models. All you had was a cutting mat, an architect's scale, a straight edge metal rule and an Exacto blade, and you had to do all of your measurements twice before committing to the cut and gluing it all together. If I had done this later in architecture school I would have used a laser cutter, but in a way it was great having to learn how to do it by hand!<p>",
      "Timeframe": {
        "Sortable": "2016-10-01",
        "Display": "Fall 2016"
      },
      "Description": "A study of Jorn Utzon's Fredensborg Houses",
      "ThumbnailImage": "images/bs.thumbnail.jpg",
      "Collaborators": [
        {
          "Name": "Curran Zhang",
          "Role": ""
        },
        {
          "Name": "Crystal Xue",
          "Role": ""
        }
      ],
      "Tags": [
        "Architecture",
        "Studio"
      ],
      "Images": [
        {
          "ImageURL": "images/bs.1.jpg",
          "Description": "My hand-drafted Plan drawing of one of Jorn Utzon's Fredensborg Houses."
        },
        {
          "ImageURL": "images/bs.2.jpg",
          "Description": "My hand-drafted Section drawing of one of Jorn Utzon's Fredensborg Houses."
        },
        {
          "ImageURL": "images/bs.3.jpg",
          "Description": "My hand-drafted Elevation drawing of one of Jorn Utzon's Fredensborg Houses."
        },
        {
          "ImageURL": "images/bs.4.jpg",
          "Description": "My hand-drafted worm's eye Paraline drawing of one of Jorn Utzon's Fredensborg Houses."
        },
        {
          "ImageURL": "images/bs.5.jpg",
          "Description": "Physical model of three isolated Fredensborg Houses. Mine is visible in the center."
        },
        {
          "ImageURL": "images/bs.6.jpg",
          "Description": "Aerial view of the three isolated Fredensborg Houses in their site model"
        },
        {
          "ImageURL": "images/bs.7.jpg",
          "Description": "Models with their rooves removed."
        },
        {
          "ImageURL": "images/bs.8.jpg",
          "Description": "My model with the roof removed, relocated for a better view."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Cube House",
      "BodyContent": "<p>The Cube House Project, also known as the Wedding Pavilion design project, was a studio project where we were given a site covered in hedge, and it was up to us to modify the site to fit the program and the cube house itself. One side of the site had a road while the other faced Lake Erie. The program called for a place for the wedding to take place, room for the couple to get ready and then make their way to the stage, a location for a reception, and some parking and bathrooms.<br><br>\n\nThe deliverables for the project had many pieces. We needed sections and a hand-rendered plan fit to a 1/4\"=1' scale, as well as a scaled hand-rendered perspective. We also had digital renders, and finally, the scaled wooden model.<br><br>\n\nThe design itself took heavy inspiration from a theatrical stage, and the layout had a counter-clockwise circulation pattern. Spaces were meant to emphasize transition and threshold.<br><hr><br>What I really appreciated about this project was that it was the first studio project where we had to heavily engage with the architecture woodshop, and reflecting upon my work, the design itself might not have been all too compelling, but the experience I gained in assembling the site model was monumental! I took care to make sure all of my wooden pieces lined up just right and really put in the time at the woodshop. At that point, I wasn't great at making sure every piece was toleranced correctly, but to make sure everything slot together perfectly I underwent a trial by fire so to speak.<br><br>I also got to experiment more with my render settings, and for this project I tried out the Nvidia IRay plugin while most of my peers were still using the school's licensed version of VRay.<br><br>Admittedly, the grandest takeaway for this project was the rendered site plan. I framed that thing after the semester ended and it's been hanging above my bed ever since. I don't think I've ever been content with my ability to draw, but I went the extra mile to add in ambient occlusion and render the distinct textures of gravel paths and grass. If anything, it's one of the better projects I use to benchmark myself when I look back at my work years later!</p>",
      "Timeframe": {
        "Sortable": "2016-10-01",
        "Display": "Fall 2016"
      },
      "Description": "A design for a wedding pavilion on the shores of Lake Erie",
      "ThumbnailImage": "images/ch.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Architecture",
        "Studio",
        "Woodworking",
        "Big Builds"
      ],
      "Images": [
        {
          "ImageURL": "images/ch.1.jpg",
          "Description": "Overview of the Scale Model."
        },
        {
          "ImageURL": "images/ch.2.jpg",
          "Description": "Detail shot of the main stage."
        },
        {
          "ImageURL": "images/ch.3.jpg",
          "Description": "The main stage with parts removed for an interior view."
        },
        {
          "ImageURL": "images/ch.4.jpg",
          "Description": "A view of the reception area from the lake side of the site."
        },
        {
          "ImageURL": "images/ch.5.jpg",
          "Description": "A perspective render of the interior of the pavilion."
        },
        {
          "ImageURL": "images/ch.6.jpg",
          "Description": "A plan render of the site that still lives above my bed."
        },
        {
          "ImageURL": "images/ch.7.png",
          "Description": "Render of the reveal of the pavilion."
        },
        {
          "ImageURL": "images/ch.8.png",
          "Description": "Render of the view from the stage."
        },
        {
          "ImageURL": "images/ch.9.png",
          "Description": "Render of from the perspective of the audience looking towards the reception area."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Dungeon Crawl",
      "BodyContent": "<p>This was my final Project for Creative Coding and I loved it a whole lot! I ended up going way overboard any my project ended up being almost a thousand lines of code when it was only supposed to be a couple hundred. And yes, I did get a 100 and some points of extra credit for the effort. Before I go too far though, <b>The game is fully playable if you scroll down below this block of text.</b><br><br>Now, onto the project details! One of the things we covered in our class was the idea of a Turtle, an object that would move around by moving forwards, backwards, and rotating, so its motions weren't dependent on the traditional X and Y grid. I already knew that this was perfect for having basic creatures that could move around, but it would also be perfect for something like a Magic Missile that would follow an arcing non-linear path to its target. I also liked fantasy settings, being very involved with my school's Tabletop Roleplaying games club that was mostly Dungeons & Dragons, and I liked dungeon crawling video games like The Binding of Isaac. I decided that would make for a fun challenge, and so this project was born!<br><br>To briefly go over the game itself, it’s a dungeon crawler. The player goes into randomly generated rooms with randomly generated enemies which make up floors of random length. As the player progresses through the floors, the average enemy speed and number in a room will gradually increase. Paired with the player’s health that only partially returns when a floor is completed, it’s certain that the player will die. The question then is how far can they make it?<br><br>To help me troubleshoot the project, I added in a ‘debug mode’ of sorts. By pressing ‘=’, the player can see a lot of cheaty data, spawn enemies, generate the final room of each floor, and increase how many floors the game thinks the player has cleared. There were a lot of challenges. I wasn’t sure how to do level generation (the system can easily do non-linear levels by generating more doors but linear is easy to play through) and for a while, enemy AI was giving me some problems.<br><br>In the end, I’m more than happy with what I made. I enjoy playing it, I enjoyed making it, and I enjoy changing some of the settings to make the game truly ridiculous. Also the visual assets are either made by me or heavily changed free assets</p>\n<a href=\"linkedScripts/DungeonCrawl.js\" target=\"_blank\" rel=\"noopener noreferrer\">Project Source Code</a>\n<iframe src='linkedScripts/DungeonCrawl.html' width='100%' height='500px' frameborder='0'></iframe>\n<blockquote><b>Controls</b><br>Movement - WASD or the Arrow Keys<br>Cast Magic Missile - Point and click with your mouse<br><br><b>Tips</b><br><ul><li>The glow on your staff indicates how much mana you have</li><li>If you’re shooting slowly, let up on the firing and just let it recharge</li><li>The magic missiles bank towards where your mouse is when you fire them</li><li>Aim slightly ahead of enemies for best results</li></ul><br><b>Debug Controls</b><br>Toggle Debug Mode - =<br>Increase Floor Number - SHIFT<br>Spawn enemy at cursor - E<br>Make next room the exit - ENTER</blockquote>",
      "Timeframe": {
        "Sortable": "2018-11-16",
        "Display": "November 2018"
      },
      "Description": "A dungeon crawler playable within your browser",
      "ThumbnailImage": "images/dc.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Programming",
        "Game Design"
      ],
      "Images": [
        {
          "ImageURL": "images/dc.1.jpg",
          "Description": "The wizard explores the dungeon"
        },
        {
          "ImageURL": "images/dc.3.jpg",
          "Description": "The wizard finds the entrance to the next floor"
        },
        {
          "ImageURL": "images/dc.4.jpg",
          "Description": "The wizard died and the player views their stats"
        },
        {
          "ImageURL": "images/dc.2.jpg",
          "Description": "The wizard casts their most powerful spell, Debug Mode"
        },
        {
          "ImageURL": "images/dc.6.jpg",
          "Description": "My initial concept sketch for what the game would look like"
        },
        {
          "ImageURL": "images/dc.5.gif",
          "Description": "My first proof of concept with Debug Mode, which the game ended up being built off of"
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Grow Center",
      "BodyContent": "Pittsburgh has a lot of empty lots, with rowhouses frequently being broken up by staccato voids, ghosts of the buildings that once stood there. These gaps aren't dissimilar to the neighborhoods in Pittsburgh, with neighborhoods that share a border realistically taking a half hour or more to reach with the natural borders of cliffsides or the artificial boarders of busways. Our site was 7539 Susquehanna St in Pittsburgh which was a vacant lot in a food desert and the community had set up the Sankofa Village Community Garden. The goal of the Grow Center project was to develop the site and make a resource for the community.\n<br><br>\nI was interested in using the rowhouse as a unit, so I started by arraying and twisting that unit to get the overall form. The main greenhouse was just one of many spaces available for planting, and was optimized both for sunlight direction but also to be an eyecatcher on the corner of the lot to encourage visitors to engage with the grow center.\n<br><br>\nI really enjoyed getting to go out to the site, planning sustainable building systems, and researching the climate factors such as sun direction and temperatures and having to relate those to areas for growing plants. I also had my first experience with VR for this project, with my Google Cardboard from the Medieval Fantasy challenge arriving the morning of final review allowing the reviewers to experience some of the main spaces of the building in VR. I also made a flythrough gif of the space, although in hindsight the quality is pretty lacking but that's a product of my laptop at the time and the length it'd take to render individual frames. I was really satisfied with my model, and while it was small, I think it was a great representation of the building. My favorite detail, other than the wire trees, is that the doors in the back of the workshop could open and close on the model, but the one that was painted ended up getting stuck.",
      "Timeframe": {
        "Sortable": "2017-12-01",
        "Display": "Fall 2017"
      },
      "Description": "A community resource for growing and teaching",
      "ThumbnailImage": "images/gc.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Architecture",
        "Studio",
        "Big Builds"
      ],
      "Images": [
        {
          "ImageURL": "images/gc.1.png",
          "Description": "Images of the site."
        },
        {
          "ImageURL": "images/gc.2.jpg",
          "Description": "Render of the front of the Grow Center."
        },
        {
          "ImageURL": "images/gc.3.jpg",
          "Description": "Render of the back of the Grow Center."
        },
        {
          "ImageURL": "images/gc.4.jpg",
          "Description": "Plan, section, and elevation drawings."
        },
        {
          "ImageURL": "images/gc.5.jpg",
          "Description": "Overview of the building's program and systems."
        },
        {
          "ImageURL": "images/gc.6.jpg",
          "Description": "Overview of the various growing surfaces and their planned use."
        },
        {
          "ImageURL": "images/gc.7.jpg",
          "Description": "The transformation of the Rowhouse unit into the Grow Center."
        },
        {
          "ImageURL": "images/gc.8.png",
          "Description": "View of the hallway that cuts through every form."
        },
        {
          "ImageURL": "images/gc.9.png",
          "Description": "View from the interior of the greenhouse."
        },
        {
          "ImageURL": "images/gc.10.png",
          "Description": "View of the workshop with the doors open."
        },
        {
          "ImageURL": "images/gc.11.gif",
          "Description": "Flythrough of the spaces."
        },
        {
          "ImageURL": "images/gc.12.jpg",
          "Description": "View of the model in fresh Pittsburgh snow. The white foam core board vanishes into the snowy backdrop."
        },
        {
          "ImageURL": "images/gc.13.jpg",
          "Description": "View of the back of the physical model."
        },
        {
          "ImageURL": "images/gc.14.jpg",
          "Description": "Detail shot of the physical model."
        },
        {
          "ImageURL": "images/gc.15.jpg",
          "Description": "Detail shot of the physical model."
        },
        {
          "ImageURL": "images/gc.16.jpg",
          "Description": "A view of the green wall opposite the greenhouse."
        },
        {
          "ImageURL": "images/gc.17.jpg",
          "Description": "Detail shot of the model's workshop doors."
        },
        {
          "ImageURL": "images/gc.18.jpg",
          "Description": "A shot of the shadow cast by the workshop's windows. Also visible is the grate behind the workshop with access to the basement."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Hoop House",
      "BodyContent": "The Hoop House was the second stage of the Fall '17 semester, following the hanging garden project and preceding the Grow Center project. The hoop house was thinking at the scale of a greenhouse, which needed to provide life support for plants over the harsh Pittsburgh winter. Our group consisted of six members of diverse backgrounds, from design to construction. The Hoop House was made of steel conduit and greenhouse heat shrink, and was installed at Phipps Conservatory. We're fortunate that our site was just down the road, about a 5 minute walk through a park.\n<br><br>\nMy role in the project was to analyze the site conditions like the standard sun path, temperature, and humidity using Climate Consultant, as well as making a drone-scanned-style model of the site (I don't have a drone so I cheated a bit and used Google Earth). Relating to the work with sunpath, I made a Grasshopper script that displays the sun path and models surfaces based off those sun angles. As the project developed, I made construction axos and really pushed for expression through joinery, which I see as my largest contribution to the project. I assisted Sean in making full-scale working joinery mock-ups. I also got to play the role of fabricator's advocate. Our group had some fantastic designers and strong wills, and I made that our final design could be fabricated and ideally had some truly beautiful movement and joinery. At the end of the day, we were limited to electrical conduit and greenhouse plastic so there was plenty of opportunities to get creative! One final role I played was that I made a documentation video of our project with my GoPro hung off of a shelf in the ceiling.\n<br><br>\nFor a project with so many moving parts and small openings, it was one of the few that didn't fall apart or tear open when I went back to visit after winter break, and of the other greenhouses that remained intact it also kept about half of the plants alive. By that point, most of the other greenhouses had fallen down or had tears in the greenhouse plastic. The skills I learned working with conduit would be something I'd keep with me, coming into play years later with my Safety Stand project. I think this project alone helped me find my place as someone fascinated with fabrication.",
      "Timeframe": {
        "Sortable": "2017-11-01",
        "Display": "Fall 2017"
      },
      "Description": "A greenhouse made to weather the Pittsburgh winter",
      "ThumbnailImage": "images/hh.thumbnail.jpg",
      "Collaborators": [
        {
          "Name": "Gisselt Gomez",
          "Role": ""
        },
        {
          "Name": "Sean McGadden",
          "Role": ""
        },
        {
          "Name": "Jacob Moskowitz",
          "Role": ""
        },
        {
          "Name": "Louis Suarez",
          "Role": ""
        },
        {
          "Name": "Alex Wang",
          "Role": ""
        }
      ],
      "Tags": [
        "Architecture",
        "Studio",
        "Big Builds",
        "Metalworking"
      ],
      "Images": [
        {
          "ImageURL": "images/hh.0.jpg",
          "Description": "Our group sitting in front of the completed Hoop House (Gisselt is not pictured)."
        },
        {
          "ImageURL": "images/hh.15.jpg",
          "Description": "Our group visits the site for the first time in September."
        },
        {
          "ImageURL": "images/hh.1.jpg",
          "Description": "The Hoop House all buttoned up!"
        },
        {
          "ImageURL": "images/hh.3.jpg",
          "Description": "Another view of the completed Hoop House"
        },
        {
          "ImageURL": "images/hh.2.jpg",
          "Description": "After opening the external panel, you can see the sliding door inside."
        },
        {
          "ImageURL": "images/hh.4.jpg",
          "Description": "My site plan ended up becoming a massive photoshop file that I had to wrangle to export properly."
        },
        {
          "ImageURL": "images/hh.5.png",
          "Description": "My sun path analysis of our site."
        },
        {
          "ImageURL": "images/hh.6.jpg",
          "Description": "Analysis of wet/dry bulb and ground temperatures."
        },
        {
          "ImageURL": "images/hh.7.png",
          "Description": "Our project keystone, the conduit cutsheet. They're faint but you can see the markings showing where we needed to bend the conduit."
        },
        {
          "ImageURL": "images/hh.8.jpg",
          "Description": "A proof-of-concept sliding door using rails made from conduit."
        },
        {
          "ImageURL": "images/hh.9.jpg",
          "Description": "A still from our documentation video. Jacob, Sean, and I spent a lot of time in the woodshop figuring out how to drill press a rounded surface repeatably."
        },
        {
          "ImageURL": "images/hh.10.jpg",
          "Description": "A diagram showing step 1 of assembly."
        },
        {
          "ImageURL": "images/hh.11.jpg",
          "Description": "A diagram showing step 2 of assembly."
        },
        {
          "ImageURL": "images/hh.12.jpg",
          "Description": "A diagram showing step 3 of assembly."
        },
        {
          "ImageURL": "images/hh.13.jpg",
          "Description": "Our Hoop House survived the winter."
        },
        {
          "ImageURL": "images/hh.14.jpg",
          "Description": "A view of the remaining plants after winter break with snow still piled on top."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "ITAR",
      "BodyContent": "Couldn't get enough documentation images, or really anything about the final model",
      "Timeframe": {
        "Sortable": "2018-10-01",
        "Display": "Fall 2018"
      },
      "Description": "Architectural Robotics",
      "ThumbnailImage": "images/itar.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Programming"
      ],
      "Images": [
        {
          "ImageURL": "images/itar.1.png",
          "Description": "Default image description."
        },
        {
          "ImageURL": "images/itar.3.jpg",
          "Description": "Default image description."
        },
        {
          "ImageURL": "images/itar.4.jpg",
          "Description": "Default image description."
        },
        {
          "ImageURL": "images/itar.5.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Library Parasite",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/LibraryParasite/thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Studio",
        "Big Builds"
      ],
      "Images": [
        {
          "ImageURL": "images/LibraryParasite/thumbnail.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Moorewood Makerspace Renovation",
      "BodyContent": "The Moorewood Makerspace Renovation was a project spearheaded by Joseph Paetz, the president of ANVIL, the CMU maker club. During this time, ANVIL formed a small group of four to come up with ideas to bring to housing. I volunteered as the club's resident architecture student and as someone with a growing passion for makerspaces.\n<br><br>\nThe space that already was underutilized and Housing was going to renovate many of the spaces in the dorm including the makerspace. The spaces were commonly empty even in a dorm with hundreds of undergrads. Even though it was built as part of a dorm, it was difficult to access the space due to its restrictive staffing hours and the limitation that only 1 of the 3 spaces was actively staffed. These spaces would be linked by new doors as part of the renovations. Our goal was to do as much as we could to improve the space. As a group, we succeeded in beautifying the space as well as adding access to a laser cutter and 4 Dremel 3D printers. We also improved the furniture and tool options as well as adding small quality of life improvements such as noise-dampening foam and a suggestion box.\n<br><br>\nWhile most of our success is attributed to our group which made sure to meet weekly in the space, I can say that my largest direct involvement was the two hand renders where I imagined what the space could look like based on our proposals and a pinch of fantasy! I was told after the project concluded that housing was especially thankful that they looked hand drawn, specifically their rough nature meant that they were confident that there was still flexibility. If I had ended up doing everything in Rhino with photoreal rendering, they wouldn't have felt there was room to compromise.\n<br><br>\nWhile I don't have good photos of the space after the renovations, I do hear that it's one of the premier spaces for textile work on campus and is frequently in use by the Cosplay Club. Carnegie Mellon also has a yearly fashion show called SPIRIT which sees a rush of textile artists to any and all capable spaces, and I knew that before I graduated the Moorewood space was packed before that event.\n<br><br>\nThis project was my first where I got to directly improve a makerspace, and while I didn't directly conduct research I learned a lot along the way. I kept the idea of the rough renders in mind when making proposals at the Innovation Co-Lab makerspace years later, and the knowledge I gained at the Moorewood space directly informed some of my decisions when it came time to revamp the Wilson Lab at Duke. However, this project also came with one other valuable learning opportunity: documentation. I knew I had some images of the project, but I had long since lost access to the project files after graduation, and I didn't have any photos of the space after the really substantial renovations were done, nor could I find more than a few marketing photos from Housing or the Cosplay club. I'm glad I was able to uncover the original renders, but at the end of the day it's hard to prove you did something when you don't have photos. While I can't show the impact I know it had, at least I can show what I contributed!",
      "Timeframe": {
        "Sortable": "2018-03-01",
        "Display": "March 2018"
      },
      "Description": "Renovating a Makerspace in a dorm",
      "ThumbnailImage": "images/mms.thumbnail.jpg",
      "Collaborators": [
        {
          "Name": "Joseph Paetz",
          "Role": "Project Lead"
        }
      ],
      "Tags": [
        "Makerspace Improvements",
        "Architecture",
        "Technical"
      ],
      "Images": [
        {
          "ImageURL": "images/mms.1.jpg",
          "Description": "A view of the makerspace before substantial renovations."
        },
        {
          "ImageURL": "images/mms.2.jpg",
          "Description": "My hand render with proposed improvements."
        },
        {
          "ImageURL": "images/mms.3.jpg",
          "Description": "A view of the makerspace before substantial renovations."
        },
        {
          "ImageURL": "images/mms.4.jpg",
          "Description": "My hand render with proposed improvements."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Hunt Library Lighting Analysis",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/LightingAnalysis/thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Studio",
        "Architecture"
      ],
      "Images": [
        {
          "ImageURL": "images/LightingAnalysis/thumbnail.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Materials and Assembly",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/MaterialsAssembly/thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "3D Modelling",
        "Technical",
        "Architecture"
      ],
      "Images": [
        {
          "ImageURL": "images/MaterialsAssembly/thumbnail.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Medieval Fantasy Contest",
      "BodyContent": "In late 2017 I saw that Sketchfab and Mozilla were doing a design competition, with the theme being \"Medieval Fantasy\". They wanted the entries to make a scene with a bunch of low poly assets and then have all of those assets be downloadable on Sketchfab, presumably so they could be used my Mozilla for some VR development. While I was almost certainly not going to place as a finalist, all participants would recieve a branded Google Cardboard, and between that and it sounding like a more fun project then my studio work I decided to join!\n<br><br>\nHowever, there was one challenge that lay ahead. I was the most experienced in Rhino, and well, that's not a modeling program that's optimized around a low-poly workflow. I did know how to place points though, and I knew how to build surfaces between those points... Basically, I ended up hand placing many of the vertices that I'd later manually paint in with tris. After building out the terrain that way, most of my other props got made with geometric primitives and boolean operations. I did have a great time though, and enjoyed adding tiny details here and there, like the banners having knots in the string or the spears having their heads lashed into notches like arrowheads. I ended up doing versions with blue and red heraldry. There ended up being 48 individual props counting all variations! You can view the results of the competition <a href=\"https://sketchfab.com/blogs/community/amazing-scenes-won-medieval-fantasy-contest/\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>!\n<hr>\n<b>The Entire Collection</b><br>\n<iframe width=\"640\" height=\"480\" src=\"https://sketchfab.com/playlists/embed?collection=d4f85775550e4b21b12996b67a9a55be&autostart=0\"\n        title=\"Medieval Fantasy Design Competition Entry\"\n        frameborder=\"0\"\n        allowfullscreen\n        mozallowfullscreen=\"true\"\n        webkitallowfullscreen=\"true\"\n        allow=\"autoplay; fullscreen; xr-spatial-tracking\"\n        xr-spatial-tracking\n        execution-while-out-of-viewport\n        execution-while-not-rendered\n        web-share\n    ></iframe>\n    <p style=\"font-family: sans-serif;font-size: 13px; font-weight: normal; margin: 5px; color: #4A4A4A;\">\n        <a href=\"https://sketchfab.com/Dondougo/collections/medieval-fantasy-design-competition-entry-d4f85775550e4b21b12996b67a9a55be\" target=\"_blank\" rel=\"nofollow\" style=\"font-weight: bold; color: #1CAAD9;\">Medieval Fantasy Design Competition Entry</a>\n        by <a href=\"https://sketchfab.com/Dondougo\" target=\"_blank\" rel=\"nofollow\" style=\"font-weight: bold; color: #1CAAD9;\">KThies</a>\n        on <a href=\"https://sketchfab.com?utm_source=website&utm_medium=embed&utm_campaign=share-popup\" target=\"_blank\" rel=\"nofollow\" style=\"font-weight: bold; color: #1CAAD9;\">Sketchfab</a>\n    </p>",
      "Timeframe": {
        "Sortable": "2017-10-30",
        "Display": "October 2017"
      },
      "Description": "Low-poly medieval assets for a Sketchfab Competition",
      "ThumbnailImage": "images/mf.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "3D Modelling",
        "Contest"
      ],
      "Images": [],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Gray Squirrel Coffee Co",
      "BodyContent": "For two summers I worked with an architect named Matthew Ford who ran Moment Studio. It was a one-man company, and while working with him I got to contribute to a number of buildings in the area, but none would be as impactful as Gray Squirrel.\n<br><br>\nThe coffee company had already worked with Moment Studio in their renovations to install a metal awning and outdoor seating, and when I joined the project we were looking at redoing the hardscaping in front of the building. While Matthew knew a lot about the local code requirements and some of the more mundane aspects of the renovations, he left me with a lot of freedom and trust. I got to pick out lighting fixtures, do the main plan drawing showing all of our desired changes, as well as do renders to really sell the ideas. One area I got to go a little wild with was I got to propose and design a new table that would pivot near the entrance, going so far as to make an animation and BOM. While it ultimately didn't make the cut, many of the other aspects of the plan went through. This was the closest in my career I had gotten to truly feel like I was architecting, and I valued that working with a small firm meant I had a lot of flexibility and room to be creative, even if most of the job was iterating on construction drawings. It helped inform my decision to ultimately not go into the field of architecture.",
      "Timeframe": {
        "Sortable": "2018-05-21",
        "Display": "May 2018"
      },
      "Description": "Renovations of a Coffee Shop in Carrboro",
      "ThumbnailImage": "images/gs.thumbnail.jpg",
      "Collaborators": [
        {
          "Name": "Matthew Ford",
          "Role": "Architect"
        }
      ],
      "Tags": [
        "Architecture",
        "Technical",
        "3D Modelling"
      ],
      "Images": [
        {
          "ImageURL": "images/gs.1.jpg",
          "Description": "My render of Gray Squirrel after the renovations."
        },
        {
          "ImageURL": "images/gs.2.jpg",
          "Description": "My render of Gray Squirrel after the renovations."
        },
        {
          "ImageURL": "images/gs.3.jpg",
          "Description": "My overhead render showing all of the improvements."
        },
        {
          "ImageURL": "images/gs.4.gif",
          "Description": "I proposed a spinning table that would fit with the aesthetics of the gizmo door, and from experiencing a similar bench at CMU I knew it'd be really fun!"
        },
        {
          "ImageURL": "images/gs.5.jpg",
          "Description": "My drawings of the site with all the proposed changes."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Office Space",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/OfficeSpace/thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Architecture",
        "Studio"
      ],
      "Images": [
        {
          "ImageURL": "images/OfficeSpace/thumbnail.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "The Chairs",
      "BodyContent": "The goal for our project was to take a mundane object and give it a slice of humanity. Love is a powerful feeling, so much so that two objects used day to day can try to come together despite how daft the prospect sounds. While we’re used to chairs moving, it’s often by and for humans’ sake, and those chairs have finally taken charge of their abilities.<hr>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/NXNWyIUmDYY?si=u0m2dtJlXEycMh-B\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe><hr>\nThe project was very involved on both the hardware and software sides. It’s very different taking an existing object and thinking about how that could be augmented to hold specific parts while remaining as streamlined as possible. It’s something that designing a system from scratch gets around because we aren’t carpenters. It’s not in our skill set or even aligned with the goals of the project to construct chairs. As a result we had to be considerate of the way the chair was constructed so that as we added to it the essence and abilities of the chair remained intact.\n<br><br>\nThere were also a lot of choices that we made that we had to go back on. On the hardware side, our connectors for the nodding hinge at the backrest of the chair kept breaking. The metal wire would wear out as it bent in the same place, and fishing line would come untied. Given another chance, we’d definitely try using zip ties for that, as they’re more rugged and less likely to snap. We also would have used epoxy more to glue the wooden motor box to the plastic undercarriage of the chair instead of gorilla glue, as the one chair that was glued that way held up well. We also leaned to be considerate of where we glued the arduinos to the chair, as if they were touching one of the metal screws, it could short-circuit. If we could have made the chairs battery-powered, that would have solved some issues and we wouldn’t have had to make wheel bumpers, which should have been epoxied on. The hardware lesson to be learned is to build with more extensive use in mind — testing moving parts tends to degrade them.\n<br><br>\nOn the software side, we started off with a system that would better enable parallel work flows. We thought that would be important because we didn’t want to leave the software until after the hardware was done. Ideally it would develop at the same time so that as soon as the hardware was the software could be connected and the rest of the semester would’ve been finessing the interaction. The system we initially developed was two javascript sites running each robot, and communicating both to each other and the hardware (communication to the physical prototype wasn’t achieved). With the javascript, it visualized the robot with simple graphics so that we didn’t need to have the working hardware to test different behaviors. The problem with our visualized system  was that it had it’s own estimates of hard coordinates for the chair, which, given the drift that we know would happen no matter how much we try to calibrate meant the system ultimately needed some rethinking. Of course, the fact that we couldn’t get the wifi module to work was also a huge motivator. In hindsight, designing a system that lynch-pinned on a module no one had experience with before was not the best decision (though it’s a good lesson to learn for the future!). As soon as we transitioned away from the javascript/shiftr system we needed a new way for the chairs to be aware of each other. That’s where the cardinal IR sensor setup on each of the chairs came in. The receptors and beacons would be able to pick up and tell each chair an angle estimate of where the other was. For the most part that orientation to each other was what drove the chairs’ respective behaviors. For example, the servo motor script that nodded the ‘head’ (the back of the chairs could bob) triggered every time the amorous chair was looking straight at the other, as if trying to converse. (connecting wire broke day of show). The coy chair would often try to spin away from the amorous one.  Without distance sensing there was some degree of surprise built into the behavior — in some instances the chairs would bounce off each other or ‘nudge’ the other because the scripted behavior didn’t stop just because of a ‘collision’.\n<br><br>\nOn a more specific note towards how the final software was structured, it had a series of basic fundamental moves that took parameters, and a live global variable taking in sensor info — all other more complicated moves called on those and were generated according to the orientation global.\n<br><br>\nSome other aspects of the original javascript system were harder than others to carry over — for example, to keep general movement qualities like speed and acceleration, smooth while still variable, all the function moves had numbers that  referenced a global ‘mood’ int that fluctuated smoothly according to perlin noise. Choosing different moves was also dependent on the ‘mood’ variable. Higher the ‘mood’ the was supposed to enable the program to choose what moves we deemed as more ‘eager’ . An implementation of perlin noise was commented out to be dealt with after MVP was achieved, but then after reaching an MVP with switch case statements, it didn’t seem like the perlin noise would change much of the noticeable experience.\n<hr><iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/B0U082BnjWg?si=luSajRgXRuAgfUIV\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe>",
      "Timeframe": {
        "Sortable": "2018-12-01",
        "Display": "December 2018"
      },
      "Description": "Can office chairs be made to feel love?",
      "ThumbnailImage": "images/tc.thumbnail.jpg",
      "Collaborators": [
        {
          "Name": "Nick Richardson",
          "Role": ""
        },
        {
          "Name": "Marisa Lu",
          "Role": ""
        }
      ],
      "Tags": [
        "Programming",
        "Props"
      ],
      "Images": [
        {
          "ImageURL": "images/tc.1.jpg",
          "Description": "Working on the chairs."
        },
        {
          "ImageURL": "images/tc.2.jpg",
          "Description": "A view of the steppers. To keep them low profile, they stick out of the box a bit."
        },
        {
          "ImageURL": "images/tc.3.jpg",
          "Description": "a view of the various elements and how they're hidden."
        },
        {
          "ImageURL": "images/tc.4.gif",
          "Description": "The nodding mechanism for the chair. It would later be painted black to blend in."
        },
        {
          "ImageURL": "images/tc.5.gif",
          "Description": "An early hardware test of all of the chair's articulation."
        },
        {
          "ImageURL": "images/tc.6.jpg",
          "Description": "Our robot was used on the poster for the show."
        },
        {
          "ImageURL": "images/tc.7.png",
          "Description": "The lovers get a photo before the show."
        },
        {
          "ImageURL": "images/tc.8.png",
          "Description": "An artsy shot of the blackbox theater."
        },
        {
          "ImageURL": "images/tc.9.png",
          "Description": "A striking shot of a chair and its cables."
        },
        {
          "ImageURL": "images/tc.10.png",
          "Description": "The chairs find eachother."
        },
        {
          "ImageURL": "images/tc.11.png",
          "Description": "A shot of the chairs."
        },
        {
          "ImageURL": "images/tc.12.png",
          "Description": "A wide shot of the chairs."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "It'd Take a Miracle: Magical Girls at the End of the World",
      "BodyContent": "It'd Take a Miracle, or ITAM, was my first foray into solo game design, and would be the first of my yearly magical girl TTRPGs. Although I had graduated from CMU, I was still an alumnus member and a lot was remote after the pandemic. One initiative I had started during my presidency was the Game Creation Month, where we'd encourage club members to make a small game, adventure, or piece of homebrew. The timeline also coincided with a time loop set within my favorite show, <i>Puella Magi Madoka Magica</i>, so I figured it'd be a fun time to challenge myself.\n<br><br>\nThe restrictions of Game Creation Month was that the creations were to be no more than 50 pages long and the things had to be created entirely within the month of April, so I had some constraints to work with. I also wanted to make sure that most relevant content would be fully contained within a spread or two, so I had to make sure I wouldn't end up with awkward half-pages. The challenge near the end was cutting everything down to hit the 50 page limit! I decided to build a system from scratch, and I unofficially say it's run by the Miracle Engine. One of my early decisions was a dice system that involved rolling 2d6 and adding the values together, but against duplex attributes. That meant that if your Body score was 8, an 8 or below would be counted as a success for a Force roll, but you'd need an 8 or above to succeed on a Speed roll. Additionally, Your rolls could be enhanced or reduced, in which case you'd add an extra d6 to the pool. When Enhanced, you'd choose a die to remove from the pool to determine the outcome, but if the roll was Reduced the Game Master, called the Contractor, would remove a dice. The Contractor had a set of points they could build up by giving the players victories to then spend on making consequences more dire. Combat was straightforward, with the actions largely limited to theater of the mind. Players would either be Near or Far from their target and they could choose from a list of combat actions. The game also featured a win condition- if all players maxxed out their Hope, then the game probably ended in success! While the game itself was simple, I had a few opportunities to run one-shots and a campaign using it, and was exceptionally proud of how it ran. It holds up to this day.\n<br><br>\nOther than the game design aspect itself, I ended up having plenty of time to work on the formatting, and I got to spend a few days just doing artwork for the covers and character sheet. I think my takeaway was that I work really well under the pressure of a deadline and was able to really thrive with the project. Every now and then I think about making revisions, but then realize that would compromise some of the game's simplicity. One of these days I'll print it out and have it join my TTRPG bookshelf.\n<br><br>\nYou can take a look at ITAM on Itch.io <a href=\"https://dondougo.itch.io/itd-take-a-miracle/\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>!",
      "Timeframe": {
        "Sortable": "2022-04-30",
        "Display": "April 2022"
      },
      "Description": "A post-apocalypse Magical Girl TTRPG",
      "ThumbnailImage": "images/itam.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Game Design",
        "TTRPG",
        "Anime",
        "Contest"
      ],
      "Images": [
        {
          "ImageURL": "images/itam.1.jpg",
          "Description": "The front cover. I built the city from prefabs and rendered it in Rhino before some Photoshop post-processing."
        },
        {
          "ImageURL": "images/itam.2.png",
          "Description": "The splash spread right after the cover."
        },
        {
          "ImageURL": "images/itam.3.png",
          "Description": "A sample spread from character creation."
        },
        {
          "ImageURL": "images/itam.4.png",
          "Description": "A sample spread talking about gameplay mechanics."
        },
        {
          "ImageURL": "images/itam.5.png",
          "Description": "The character sheet. I drafted it completely in Rhino."
        },
        {
          "ImageURL": "images/itam.6.png",
          "Description": "The back cover of the book where you can actually see the three magical girls I modelled."
        },
        {
          "ImageURL": "images/itam.7.png",
          "Description": "A look at the itch.io page."
        },
        {
          "ImageURL": "images/itam.8.png",
          "Description": "A behind-the-scenes look at the scene I rendered for the cover. I also did a version with textures but this one ended up having more visual weight once it was composited. I also generated a depthmap which was fantastic for masking!"
        }
      ],
      "Complete": true,
      "Favorite": true,
      "Hidden": false
    },
    {
      "Title": "2 Month Magical Girl",
      "BodyContent": "2 Month Magical Girl, or 2MMG, was a great learning experience. The second of my magical girl TTRPGs, I endeavored to try something new and make a \"GM-less TTRPG\", which means that there is no game master. Instead, players would work together using the book as their guiderails. All of the other characters in the story, you know, traditionally the NPCs, would be played by player characters who were \"off-screen\". There was a dedicated Coordinator whose job it was to make sure that things stayed on track, but the entire story would be propelled by the players. These kinds of games can work great... if you have total buy-in from the group. I've always found it a bit difficult but also liberating to play these games, and in playtests my players were stiff. They didn't want to step on anyone's toes so to speak. If player A ran NPC N one way, then no players would want to be NPC N because it wouldn't be the same as the NPC N that player A ran.\n<br><br>\nThose were expected issues, and admittedly I was jumping into it pretty blind having only played one similar system in the past. However, I'm also critical of 2MMG due to the time it came out. For reference, ITAM took 1 month and ran 50 pages. 2MMG used the full month and a half to write 100 pages. That was a big leap for me, and I could only do that because I used ChatGPT to help write sections about the lore. This meant that my lore sections could be made pretty quickly and would cover everything I'd need them to, but there is an aspect of ceding over creative control of my project to AI that leaves a bitter taste in my mouth to this day. Back then I was still figuring out my stance on it, and 2MMG was the result. Ultimately, I think it's a more than passable game, but it's just not the kind of game I would make for myself. After committing to the GM-less system, there was no way I could decouple that. But hey, that's why I appreciate It'd Take a Miracle and Warded Wishes even more, and Warded Wishes would not have been as much of a passion project if I hadn't been unsatisfied with 2MMG. Plus I got to introduce a lot more ideas and make more roll tables that would make their way into Warded Wishes.\n<br><br>\nTo speak briefly on some of the mechanics, one of the key features was Bonds and Memories, which provided a mechanical benefit. Bonds are the people you know, and Memories are the literal memories your character has that help drive them, good and bad. My interacting with your Bonds you could increase and decrease your Bond level, and Memories were similar. When those levels were high enough, it'd give you Resolve, representing your increased willpower and determination. All the while, during the day you'd face adversity through having to go to school or work. As time would progress, the world around them would change as Harbinders would appear, be they changes in the City or the Monstrosities you fought. Players used Playbooks to generate their characters. Each Playbook came with a set of stats and different memories to help differentiate themselves off the bat. Additionally, you had magical Specialties like being a Summoner or Illusionist. In short, the goal of the game was to buff your stats by gaining experience and levelling up your Memories and Bonds while getting rid of Traumas so that at the end of the 2 Months when disaster struck, you'd be able to fend it off. Conveniently, if you lost that fight the game would be able to transition into It'd Take a Miracle.",
      "Timeframe": {
        "Sortable": "2023-04-30",
        "Display": "April 2023"
      },
      "Description": "A GMless Magical Girl TTRPG where you race against the clock",
      "ThumbnailImage": "images/2mmg.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Game Design",
        "TTRPG",
        "Anime"
      ],
      "Images": [
        {
          "ImageURL": "images/2mmg.1.jpg",
          "Description": "The cover page of 2MMG."
        },
        {
          "ImageURL": "images/2mmg.2.png",
          "Description": "A spread detailing the combat system."
        },
        {
          "ImageURL": "images/2mmg.3.png",
          "Description": "A spread covering the Dreamer playbook."
        },
        {
          "ImageURL": "images/2mmg.4.png",
          "Description": "A spread of random roll tables."
        },
        {
          "ImageURL": "images/2mmg.5.png",
          "Description": "The character sheet that was drafted in Rhino."
        },
        {
          "ImageURL": "images/2mmg.6.png",
          "Description": "The titular two months that the game covers."
        },
        {
          "ImageURL": "images/2mmg.7.png",
          "Description": "A look at the game's Itch page."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Warded Wishes",
      "BodyContent": "Warded Wishes means a lot to me. Warded Wishes would be the 3rd of my yearly magical girl TTRPGs. I decided that for this one, I'd start up an actual Game Jam on Itch.io for my yearly games, so this would be the first and only submission in the first Countdown to Walpurgisnacht game jam. I don't remember much about the crazy 3 weeks I spent making this game, but I knew that once the haze had cleared and I looked back at it, I had made something special. I didn't use AI. It was 100 pages long. In 3 weeks.\n<br><br>\nTo briefly talk about the system itself, I wanted to make something a little more \"tactical\", where combat was a focus and took place on a hex grid and positioning would matter. Characters had not just an Archetype, traditional classes like Leader, Defender, and Witch, but they also had a Magical Specialty like Barrier magic or Teleportation. Players would have to balance not just their lives as magical girls, but had an Obligation system where they would have to keep up with academic, social, and work obligations. The game expanded on It'd Take a Miracle's action system with an expansive list of actions with various tags that could be used in different contexts. The game also featured an innovative Fate Pool adapted from Kamigakari where players would have a pool of dice they could use to retcon rolls and spend on magic while introducing a layer of resource management. In short, the game had a lot of systems, all lovingly formatted to make the reading experience pleasant.\n<br><br>\nI set up some goals at the start, and by the end I had blown past them. Of course, that did come with the cost of working on the game during almost every free waking hour and my sleep schedule did get a bit messed up as a result. I truly believe that I captured lightning in a bottle with this one, and while I can't say what I'll do in my future yearly games, I can say that I plan to spend more time working on this game and building out modules more than I am likely to try and one-up it. I do regret my pace though. I ended up putting it off for a few weeks, which meant that by the time I finally figured out the direction I wanted to take it and the framework I'd use, I only had 3 weeks of my deadline left, which I did use to get the game to a completeish state. That also ended up burning me out afterwards, and while I did have an opportunity to playtest it, it was nowhere near what I needed to make substantial improvements to the game. However, I did go back later on after the game was done and create a google sheets character sheet with automation in lieu of a drafted Rhino sheet, and with the aid of ChatGPT I implemented the dice system in Foundry VTT, enabling easier playtesting in the future. \n<br><br>\nYou can take a look at Warded Wishes on Itch.io <a href=\"https://dondougo.itch.io/warded-wishes/\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>!",
      "Timeframe": {
        "Sortable": "2024-04-30",
        "Display": "April 2024"
      },
      "Description": "My Magnum Opus Magical Girl TTRPG",
      "ThumbnailImage": "images/ww.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Game Design",
        "TTRPG",
        "Anime",
        "Contest",
        "Programming"
      ],
      "Images": [
        {
          "ImageURL": "images/ww.1.png",
          "Description": "The front cover of Warded Wishes."
        },
        {
          "ImageURL": "images/ww.2.png",
          "Description": "The back cover of Warded Wishes."
        },
        {
          "ImageURL": "images/ww.3.jpg",
          "Description": "A sample spread detailing the Fate system."
        },
        {
          "ImageURL": "images/ww.4.png",
          "Description": "An example of one of the Archetypes."
        },
        {
          "ImageURL": "images/ww.10.png",
          "Description": "An example of some Actions."
        },
        {
          "ImageURL": "images/ww.5.png",
          "Description": "An example hexmap representing a region of the Ward."
        },
        {
          "ImageURL": "images/ww.6.png",
          "Description": "A look at the Itch page."
        },
        {
          "ImageURL": "images/ww.7.png",
          "Description": "My google sheets character sheet."
        },
        {
          "ImageURL": "images/ww.8.png",
          "Description": "A look at the Foundry menus for interfacing with the Fate system."
        },
        {
          "ImageURL": "images/ww.9.png",
          "Description": "A look at the Foundry chat output when a magical girl uses Fate."
        }
      ],
      "Complete": true,
      "Favorite": true,
      "Hidden": false
    },
    {
      "Title": "Magical Girl in Pittsburgh",
      "BodyContent": "A Magical Girl in PGH was a short text adventure I made starring one of my Original Characters, a magical girl in Pittsburgh named Milena Lenart. This project was the one where object-oriented programming finally clicked for me, since the engine we were using to make the games, Quest, had objects, commands, and rooms as its building blocks. You'd like how commands worked on the room or object, and each room contained objects and connections to other rooms, and so forth. So that was an exciting \"Aha!\" moment.\n<br><br>\nThis was also the first game I made that wasn't a TTRPG that I did playtests of, and in this case it was important seeing how the players engaged with the game. You got to see people problem-solve in different ways, and thorugh that you learned how to make your game more accessible by making multiple methods feasible. When the game starts, you're fighting a witch. What verb to you use? Attack? Hit? Kill? It was things like that that I appreciated in the project. Plus, I got to flesh out one of the characters that had been living in my head for a while.\n<br><br>\nLater on, this experience would become relevant once again when one of my friends wanted to make a visual novel, which is pretty similar to text adventures in their own right. You plot out choices and their consequences, but those just have art while this is just text. That project wouldn't come to fruition, but I was able to help guide the project a bit because of my experience making this game!",
      "Timeframe": {
        "Sortable": "2020-01-30",
        "Display": "January 2020"
      },
      "Description": "A Magical Girl Text Adventure",
      "ThumbnailImage": "images/mgp.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Game Design",
        "Programming",
        "Anime"
      ],
      "Images": [
        {
          "ImageURL": "images/mgp.1.png",
          "Description": "The start of the text adventure."
        },
        {
          "ImageURL": "images/mgp.2.png",
          "Description": "Looking around."
        },
        {
          "ImageURL": "images/mgp.3.jpg",
          "Description": "The chart showing options and interactions."
        },
        {
          "ImageURL": "images/mgp.4.png",
          "Description": "My playtest feedback."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Locker Organization",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Makerspace Improvements"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Dice Box from Scraps",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Woodworking",
        "Gaming",
        "Mini Makes"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Sewing Carts",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Woodworking",
        "Makerspace Improvements"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Kevin Says",
      "BodyContent": "<p>When I started at the Innovation Co-Lab, I identified that I'd occasionally to leave up short messages, and wanted an opportunity to greet people when they entered the space and make sure they were comfortable asking me questions, and so the \"Kevin Says\" sign came into being. I got to familiarize myself with the Waterjet, cutting out the piece of steel, as well as slot in some wooden legs and laser cut some thick acrylic to act as the dry erase surface. I styled it like a speech bubble and added some flair, and voila!\n<br><br>\nAs mentioned earlier, this was useful in the late/post-pandemic era as people would enter the lab and it'd be pretty empty, and often times they'd go no further than the doorway. I placed this sign on a nearby table, and my default message was \"Let me know if you have any questions!\", and because of that I think people were more willing to step through the threshold. It saw less frequent use once we fully transitioned out of the pandemic and had a lot of student staffers again, but for a while I can say with certainty that this piece of hardware helped further my mission of getting people into the makerspace!</p>",
      "Timeframe": {
        "Sortable": "2021-10-8",
        "Display": "October 2021"
      },
      "Description": "A custom dry-erase sign",
      "ThumbnailImage": "images/kss.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Woodworking",
        "Laser Cutting",
        "Makerspace Improvements",
        "Metalworking",
        "Props",
        "Mini Makes"
      ],
      "Images": [
        {
          "ImageURL": "images/kss.1.jpg",
          "Description": "The brand new sign in use."
        },
        {
          "ImageURL": "images/kss.2.gif",
          "Description": "A turntable of the sign."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Machined Homura Shield",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Metalworking",
        "Anime"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Kikuo Standee",
      "BodyContent": "Kikuo is one of my favorite Vocaloid producers. I drove all the way to Atlanta through a tropical storm to make sure I could catch his first performance ever in the US, and when I saw that his solo tour would have a spot in Charlotte right after my birthday, I knew I had to go. However, that raised a question... If I could get Kikuo to sign something at the VIP Meet and Greet, what would I want him to sign? Well, it was the day of the concert and I decided I wanted to make a custom acrylic standee based on the concert's poster, but the clock was ticking before I had to hit the road.\n<br><br>\nI ended up making the base of the standee that day and shoved it in my pocket. My plan was to get that part signed, and then after that there wouldn't be any sort of deadline to finish the rest! Well, I went to the concert and had a blast and at the very end found myself in the line for the meet and greet, and while Kikuo wasn't doing photos that day, he would sign one thing for each person in line! I went up, got the base signed, and Kikuo said he thought it was cool! I was in heaven! However, with the deadline now past, I took months to finally figure out the rest.\n<br><br>\nI started by finding the full art that was used on the poster. The original image was pretty compressed, but it would have to be good enough. I split the image into layers and sent the stickers to print on sticker paper to be later cut on the Cricut. I had the outline of the designs as well, and after some iterations I was able to get a properly scaled version in Rhino which I laser cut. I tried a few ways of lining the sticker up on the acrylic, but at the end of the day just eyeballing it and placing the cut sticker on the cut acrylic worked best. I gave it some coats of clear spray paint and that was it! However, I ended up going back and revising it, adding fist another layer for just the main mascot charater, since one drawback of the image was that the mascot blended in too well. I also ended up adding on a background layer, and while I couldn't replicate the design on the poster, I could go and make my own version!\n<br><br>\nI still have ideas about making an add-on for the base and edge lighting the acrylic, but for now I'm happy with this the way it is! At the end of the day, if you want a memroable piece of merchandise, you'll do much better making it yourself!",
      "Timeframe": {
        "Sortable": "2024-08-27",
        "Display": "August 2024"
      },
      "Description": "Custom Concert Merch",
      "ThumbnailImage": "images/ks.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Laser Cutting",
        "Props",
        "Anime"
      ],
      "Images": [
        {
          "ImageURL": "images/ks.5.jpg",
          "Description": "It all started the day of the Kikuo Concert in Charlotte. Take note of the design on the screen!"
        },
        {
          "ImageURL": "images/ks.1.jpg",
          "Description": "I threw together this file the day of the concert, and after I got Kikuo's signature I covered it with an adhesive acrylic laminate to make sure it wouldn't get scratched off."
        },
        {
          "ImageURL": "images/ks.2.jpg",
          "Description": "The first iteration, all on one layer of acrylic."
        },
        {
          "ImageURL": "images/ks.3.jpg",
          "Description": "A view of the final 3-layer acrylic piece."
        },
        {
          "ImageURL": "images/ks.4.jpg",
          "Description": "A view of the final 3-layer acrylic piece."
        },
        {
          "ImageURL": "images/ks.6.jpg",
          "Description": "The colors of the background are much more visible in direct sunlight."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "LARP Belt",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Laser Cutting",
        "LARP"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "LARP Rapier",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "LARP",
        "Foamsmithing",
        "Casts and Molds",
        "3D Printing",
        "Props"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Don Standees",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Laser Cutting",
        "Anime"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Sharkboo",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "3D Printing",
        "Props",
        "Anime"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Banana Chair",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Big Builds",
        "Woodworking",
        "Anime",
        "Props"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": true,
      "Hidden": false
    },
    {
      "Title": "Graduation Gifts",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Woodworking"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "LARP Tombstones",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "LARP",
        "Foamsmithing",
        "Props"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Resin Dice",
      "BodyContent": "A little while after joining the Co-Lab, I volunteered to inherited our resin workshops. At first, I stuck with some conventional classes I had already helped run in the past where we made resin coasters. However, as we were looking to expand the Roots offerings, I suggested we do a dice class with resin. It was readily approved and all we needed to get were the molds.\n<br><br>\nIn my time there, I probably ran 8 of these workshops. I really enjoyed the resin classes since there's a surprising amount of artistry you can get from the mica powders, dyes, pouring techniques, and other add-ins. Plus, while the class was pretty quick we had a lot of time to chat while waiting for bubbles to make their way out of the resin. The class also always attracted a neat crowd as well! I remember one class we had a member of faculty who said their son was getting into D&D and they wanted to make him a set of dice. There were also a mix of graduates and undergrads who had either recently gotten into D&D, had been playing D&D for a while, and those who were playing other systems. This gave them a shared topic to chat about, and usually they'd talk about their characters, what they were like, and fun stories from the tabletop. Regardless of age or program, people just got along well and made connections with those they wouldn't have ever interacted with before. The week afterwards would have the students come back and ink their dice, which is a tedious task which takes a couple of hours for a full set of dice, but once again the repetitive task meant that everyone was really chill and relaxed as they once again got to chat with their fellow students.\n<br><br>\nThe physical takeaway from the class was the dice, yes. However, the less tangible takeaways were far more valuable and special, and that's not just the skills they learned during that journey. The resin dice class perfectly encapsulated why I do what I do, it's to get people in the space, learning skills, and making connections!",
      "Timeframe": {
        "Sortable": "2024-10-01",
        "Display": "2022-2024"
      },
      "Description": "A workshop series fostering a community",
      "ThumbnailImage": "images/rd.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Gaming",
        "Casts and Molds",
        "Teaching"
      ],
      "Images": [
        {
          "ImageURL": "images/rd.1.jpg",
          "Description": "One of my favorite sets of dice."
        },
        {
          "ImageURL": "images/rd.2.jpg",
          "Description": "Dice before getting demolded."
        },
        {
          "ImageURL": "images/rd.3.jpg",
          "Description": "The dice out of the mold."
        },
        {
          "ImageURL": "images/rd.5.jpg",
          "Description": "two sets of dice and the block made from the excess resin."
        },
        {
          "ImageURL": "images/rd.6.jpg",
          "Description": "Dice waiting to be capped off and put in the pressure pot."
        },
        {
          "ImageURL": "images/rd.7.jpg",
          "Description": "Two matched sets of dice."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "LARP Buckler",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "DeVaughn Fibrillator Plaque",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Stained Glass Ornaments",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Nerf Break-Action Rifle",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Travel Sewing Kit",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Triangle Rock Club Sign",
      "BodyContent": "So picture this: It's your brother's birthday. You're at work. You don't have a gift. That's the situation I found myself on in 2023, but I had a makerspace full of tool and scraps to work with.\n<br><br>\nThis was a very fun build, and has one of the highest production qualities out of <i>everything</i> I've ever made. It's all the more remarkable that it was made in one day completely from scraps. One of our users was laser cutting a lot of pre-finished wood floorboards, so I used that scrap to make the body and legs. The edges were pretty charred, so I sanded everything with a random orbit sander and rounded out a lot of the edges. I wrote a note for my brother and took a photo of it so I could vectorize it and engrave it onto the back. The stains on the wood were just watered down acrylic paints, carefully tapped into place. The wood did most of the job absorbing the water, while the lines I had scored into the surface meant that they wouldn't go outside their lines. Inspired by my \"Kevin Says\" sign, I cut some scrap acrylic to make it a dry erase board. The Triangle Rock Club logo I took from online and vectorized in illustrator. I waterjet some of my scraps from the stained glass class I taught to make that triangle behind the logo, and the rest of the logo was white acrylic with the masking paper scored through and selectively removed, with black spray paint doing most of the work. Fun fact, the acrylic is held ont the glass by some double-sided tape I cut to size with the Cricut, and the glass is held to the wood by a similar piece of double-sided tape.\n<br><br>\nSo why TRC? Well, my brother loves rock climbing there. He goes climbing probably every 3rd or 4th day. TRC also has some great visual branding on their holds, which is where I got the color scheme for the build from! I think at the end of the day, the time and care that someone puts into a gift is what matters, not the value of the materials themselves. Even though this was a quick sprint of a project, I think the love and care really shows.",
      "Timeframe": {
        "Sortable": "2023-07-21",
        "Display": "July 2023"
      },
      "Description": "Same-Day Birthday Present",
      "ThumbnailImage": "images/trc.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Props",
        "Laser Cutting",
        "Woodworking",
        "Mini Makes"
      ],
      "Images": [
        {
          "ImageURL": "images/trc.1.jpg",
          "Description": "A view of the finished plaque."
        },
        {
          "ImageURL": "images/trc.2.jpg",
          "Description": "A view of the finished plaque."
        },
        {
          "ImageURL": "images/trc.3.jpg",
          "Description": "The engraving on the back of the plaque means something to rock climbers."
        },
        {
          "ImageURL": "images/trc.4.jpg",
          "Description": "A view of the finished plaque."
        },
        {
          "ImageURL": "images/trc.5.gif",
          "Description": "The plaque on a turntable."
        },
        {
          "ImageURL": "images/trc.6.jpg",
          "Description": "A random image of TRC Durham from online. You can see what inspired the color scheme!"
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Custom Lamp",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "ITAC Gavel",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Lights and Fog",
      "BodyContent": "RSMA final project, nothing listed bit collab with Kirman, Claire Koh, Ryu Kondrup, and Devon B. I could probably find video of it?",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Dune Matador Statue",
      "BodyContent": "This was a Christmas gift for my father, who's been a big fan of Dune. He was elated when the new movies came out, and after watching Dune 2021 in Imax there was one prop that really stood out in my mind. The original Matador statue was designed by Luke Massassi, who has a gallery showing how he 3D printed, electroplated, and weathered the prop used on screen. However, he also made the original files available for download so anyone willing to shell out a few bucks can make one! If you want to check that out, the post is linked <a href=\"https://www.artstation.com/artwork/B3mV9z\" target=\"_blank\" rel=\"noopener noreferrer\">here</a>.\n<br><br>\nI made sure to take my time with this one and really put some TLC into it. After the prints were done, I went in with green goop and filled the gaps that were inevitable with overhangs and such. When that was dry I'd go to town with my cabinet scrapers, reapplying green goop as needed. Eventually it was smooth enough that the layer lines were fairly hidden! I wanted the statue to look like copper, so I started with my favorite Rustoleum Oil Rubbed Bronze spray paint, followed by some basic weathering with a black wash and highlighted with a light green wash. At this point, it looked like pretty aged copper! However, the part that really brought it together was the highlights.\n<br><br>\nI diverged from the screen prop here as I imagined a world where Paul had played with this statue throught his youth, and I imagined what areas would see a lot more wear. The head of the matador? The horns of the bull? I hit those areas and the edges with a thin layer of gold Rub'n'Buff, which made the highlights really pop! Plus, the reveal of the shiny gold made it the illusion of copper so much more believable. This was a great prop to build!",
      "Timeframe": {
        "Sortable": "2022-12-25",
        "Display": "December 2022"
      },
      "Description": "A replica of the statue from Dune 2021",
      "ThumbnailImage": "images/dbf.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Props",
        "3D Printing"
      ],
      "Images": [
        {
          "ImageURL": "images/dbf.0.jpg",
          "Description": "A still from the movie where you can see the original prop."
        },
        {
          "ImageURL": "images/dbf.1.jpg",
          "Description": "The finished Matador takes on the bull."
        },
        {
          "ImageURL": "images/dbf.2.jpg",
          "Description": "An overview of the finished prop."
        },
        {
          "ImageURL": "images/dbf.3.jpg",
          "Description": "An overview of the finished prop."
        },
        {
          "ImageURL": "images/dbf.5.jpg",
          "Description": "An overview of the finished prop."
        },
        {
          "ImageURL": "images/dbf.4.jpg",
          "Description": "After printing, everything was filler puttied and scraped smooth with cabinet scrapers."
        },
        {
          "ImageURL": "images/dbf.6.jpg",
          "Description": "The base coat of spray paint."
        },
        {
          "ImageURL": "images/dbf.7.jpg",
          "Description": "A dark wash was applied and wiped off for weathering."
        },
        {
          "ImageURL": "images/dbf.8.jpg",
          "Description": "Some layers of light green wash were carefully applied to look like copper patina. Highlights of Rub'n'Buff followed."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Acrylic Wave Bracelet",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Benchy Wreath",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Don Keychains",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Aluminum D12",
      "BodyContent": "It's appropriate that a single dice is called a die, because I feel like that's what would happen if I threw this at someone.\n<br><br>\nOn the nineteenth of May, I was told to stress test the waterjet. We'd been having a lot of water pressure issues and it'd been a while since we'd really put it to the test. We also had a really nice chunk of half inch think aluminum in our scrap bin. The gears began to turn... Wrapping my head around the file took a bit, but I made sure to measure twice. After coming up with a custom pip pattern, because no way was this going to take numbers well, I generated a toolpath in fusion and threw it on the waterjet for about 45 minutes. We were all worried that there'd be another pump issue, or the water pressure would be too low, or with all of the starts and stops the nozzle would clog, but to our surprise the waterjet worked perfectly fine!\n<br><br>\nSo phase 2 began. I wiped all of the parts dry, but those edges were sharp! I countersunk the holes, just to make them look nice, and started lining everything up. The pieces were a really tight fit so it took a while to get everything lined up for assembly. I grabbed a mallet and started hammering. Turns out hammering while filming was tricky, so after putting the camera down I grabbed a larger dead blow mallet and slammed it until everything was lined up. Now when I say the tolerance was perfect, I mean it. The edges were perfectly aligned and really sharp, which meant that it was painful to hold. I considered sanding down the faces or deburring the edges, but my conclusion was that the perfect, sharp edge was just a testament to my measuring and should be maintained. I also don't think I'd be comfortable rolling the dice on anything other than carpet, because it makes an awful thumping noise since its hollow and the sharp metal edges would scratch up any wood or glass it was rolled on.\n<br><br>\nIs there a moral to this story? I suppose the answer to that is measure twice, cut once, and if you treat your machines well and know how to work them properly, they won't let you down. Alternatively, people may continuously complain about machines having issues but everything will miraculously work when it's the technician.",
      "Timeframe": {
        "Sortable": "2022-05-19",
        "Display": "May 2022"
      },
      "Description": "3 pounds of pain",
      "ThumbnailImage": "images/d12.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Gaming",
        "Metalworking",
        "Mini Makes"
      ],
      "Images": [
        {
          "ImageURL": "images/d12.1.jpg",
          "Description": "The finished die."
        },
        {
          "ImageURL": "images/d12.2.jpg",
          "Description": "The finished die."
        },
        {
          "ImageURL": "images/d12.3.jpg",
          "Description": "The waterjet struggled, but it prevailed."
        },
        {
          "ImageURL": "images/d12.5.jpg",
          "Description": "The pieces fresh out of the waterjet."
        },
        {
          "ImageURL": "images/d12.4.jpg",
          "Description": "I countersunk the holes so they'd look nicer."
        },
        {
          "ImageURL": "images/d12.6.jpg",
          "Description": "Arranging the parts for assembly."
        },
        {
          "ImageURL": "images/d12.7.gif",
          "Description": "The tolerances were so snug I had to violently hammer everything into place."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Tracy's Floor Register",
      "BodyContent": "Tracey Futhey is a VP and the CIO of Duke University. That means that as a technician at the Innovation Co-Lab, she was my boss' boss' boss' boss. However, for a few days in early June she was just another user at the Co-Lab.\n<br><br>\nThis project ended up being pretty special for me, not just because it got to humanize the CIO for me but also because it really goes to show that making is for <i>everyone</i>! It was also kind of serendipitous in a way. It turns out we both have backgrounds from Carnegie Mellon, where she got her degree in mathematics with a Computer science concentration before CS was really a thing and while the university was still known as Carnegie Tech. She worked there as a computer consultant and eventually rising to be the CIO there as well.\n<br><br>\nAnyways, Tracy had come in with an interesting project. She was reflooring her bathroom with tiles, and had bought a chameleon hvac register that had slots so you could add your own material to it. She already had the dimensions of the register, but we grabbed some calipers and double checked everything. From there I helped her CAD a model in Fusion and showed her how to toolpath it. We did a few test cuts and she left for the day. She came back a couple of day later and we dialed in tolerances and started cutting the final pieces. I had taught Tracey the process the first day and one that second day she was doing most of the operation herself!\n<br><br>\nWhenever it came up in conversation later on, she'd always say that I did all the work. But believe me, she truly learned the process and was rocking and rolling on her own by the end of it! It's something you see with all sorts of folks. I think of it like teaching someone to ride a bike. You get them on the training wheels and give them a push, and at the end of the ride they might not think they did well, not realizing that you took off the training wheels long ago. Ultimately, it's easy to say that I'll only remember this encounter because it was the CIO, but at the same time I just think she was another person who came in with the right attitude.",
      "Timeframe": {
        "Sortable": "2022-06-03",
        "Display": "June 2022"
      },
      "Description": "A custom tile hvac register",
      "ThumbnailImage": "images/tfr.thumbnail.jpg",
      "Collaborators": [
        {
          "Name": "Tracey Futhey",
          "Role": "Client"
        }
      ],
      "Tags": [
        "Teaching",
        "Mini Makes"
      ],
      "Images": [
        {
          "ImageURL": "images/tfr.1.jpg",
          "Description": "The completed floor register."
        },
        {
          "ImageURL": "images/tfr.3.jpg",
          "Description": "Test parts for figuring out offsets and tolerancing."
        },
        {
          "ImageURL": "images/tfr.2.jpg",
          "Description": "Tracey operating the waterjet."
        },
        {
          "ImageURL": "images/tfr.4.jpg",
          "Description": "The waterjet cuts the outer part of the register."
        },
        {
          "ImageURL": "images/tfr.5.jpg",
          "Description": "Tracey removes a finished part from the waterjet."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Tabletop Toolkit",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Oakydeer VRChat Model",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Safety Stand",
      "BodyContent": "The Safety Stand was a project I made because we knew we wanted to make PPE more visible. Our fist aid kits were tucked into drawers and we only sold safety glasses in the vending machine. While it was against university policy to have shared safety glasses (to prevent the spread of pinkeye), we deemed that it was much less safe having people operate drills and saws without eye protection. I decided this was a great time to bring out my skills from the Hoop House project, so I got to designing in Rhino and started printing out my bending guides.\n<br><br>\nThe big thing for this project was it was my first time really diving into Autodesk Fusion. I had used it for a short class before, but Fusion's just better suited for this kind of iterative engineering CAD compared to Rhino. The final Safety stand had a total of 34 3D printed components, all of which I had to iterate a few times. This trial by fire got me up to speed with this new CAD program while also being a very functional and aesthetically pleasing piece.",
      "Timeframe": {
        "Sortable": "2021-07-07",
        "Display": "July 2021"
      },
      "Description": "A stand for PPE and first aid visibility",
      "ThumbnailImage": "images/ss.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Makerspace Improvements",
        "3D Printing",
        "Metalworking",
        "3D Modelling"
      ],
      "Images": [
        {
          "ImageURL": "images/ss.1.jpg",
          "Description": "The completed stand."
        },
        {
          "ImageURL": "images/ss.2.jpg",
          "Description": "A view of the stand's labelled bins and some of the joinery."
        },
        {
          "ImageURL": "images/ss.4.jpg",
          "Description": "The disinfectant holder was held on with zip ties and rubber pads."
        },
        {
          "ImageURL": "images/ss.5.jpg",
          "Description": "A blurry view of the hardware holding the ear plug dispenser in place."
        },
        {
          "ImageURL": "images/ss.6.jpg",
          "Description": "The difference between unsanded and sanded steel conduit. The conduit was sanded at 220 grit to clean the surface and give a satin, almost holographic appearance."
        },
        {
          "ImageURL": "images/ss.7.jpg",
          "Description": "The first pieces of conduit were bent, forming almost an earplug staff. You can see the tape used to mark where bends would start/end."
        },
        {
          "ImageURL": "images/ss.8.jpg",
          "Description": "A side view. The compound bends meant that the ear plug dispenser would be centered."
        },
        {
          "ImageURL": "images/ss.9.jpg",
          "Description": "The body starts to come together, take note of the screws on the green plate. These were what the ear plug dispenser hung from."
        },
        {
          "ImageURL": "images/ss.10.jpg",
          "Description": "The first bins are mounted and more hardware is added."
        },
        {
          "ImageURL": "images/ss.11.jpg",
          "Description": "The stand with all bins mounted."
        },
        {
          "ImageURL": "images/ss.12.jpg",
          "Description": "I added labels on two of the lids so they could hold clean and dirty safety glasses. The 3D printed component slotted into the channels on the lid, but were screwed down to make sure they'd stay."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Bookmarks",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "CATAN Board",
      "BodyContent": "Perhaps it was propelled by the pandemic, but after restrictions were lifted there was a year some of the most common laser cut and 3D print files we'd see were CATAN boards. I like a good game of CATAN and even studied it in college, but what bothered me was how simple the design was that people were grabbing from thingiverse, and it was always the same file. I decided that I needed to make a CATAN board file for the Co-Lab, and so of course I went a bit overboard.\n<br><br>\nI love the classic look of the CATAN tiles where it looks like top-down views of the landscape and each tile is unique, so I decided to make grasshopper scripts that could generate these designs. I started with the fields, which took a few lines as input and generated the rows. It was pretty simple, but I liked the look. It looked better with a bit of manual tweaking. I moved on to the forests, and that's where I had a lot of fun. You'd draw the roads and the trees would be automatically generated and pushed away from the road. I ended up tweaking a few to add a pond or make it look like the forest was being cut down. closer to the end I'd make the desert tile which would function in a similar way to look like dunes.\n<br><br>\nThe rest still needed Grasshopper files, but the inputs were more manual. The fields with herds of sheep took curves as input and would generate the little sheep heads and bodies in turn. The mountains took 3D models of mountains and generated topo lines. The quarries for brick were pretty manual and just used the Grasshopper script to generate some lines to try and sell the depth of the quarries.\n<br><br>\nHowever, then we get to the labels! I had a script for making Scrabble tiles already, so I adapted that to automate making the circles with values and pips. My second-favorite script behind the forest generation one was the script that automatically generated the shoreline. It was designed so that the tangent of the splines always lined up the same way, so no matter how you put them together the shoreline would always look seamless. This script truly was automatic, and you could generate a new shoreline with the press of a button!\n<br><br>\nAll in all there were 8 Grasshopper files made for this project! The only drawback with this project.. is that I don't really play CATAN, so I've never used it.",
      "Timeframe": {
        "Sortable": "2021-12-14",
        "Display": "December 2021"
      },
      "Description": "A programmatically generated CATAN board",
      "ThumbnailImage": "images/cb.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Laser Cutting",
        "Programming",
        "Gaming"
      ],
      "Images": [
        {
          "ImageURL": "images/cb.1.jpg",
          "Description": "An overview of the finished CATAN board."
        },
        {
          "ImageURL": "images/cb.2.jpg",
          "Description": "A close look at the ports."
        },
        {
          "ImageURL": "images/cb.3.jpg",
          "Description": "A close look at the desert."
        },
        {
          "ImageURL": "images/cb.4.jpg",
          "Description": "A close look at a port and the shoreline."
        },
        {
          "ImageURL": "images/cb.5.jpg",
          "Description": "An overview of the finished CATAN board."
        },
        {
          "ImageURL": "images/cb.6.jpg",
          "Description": "A look at the tiles that were customizable in Grasshopper. The Desert is in that group but not pictured."
        },
        {
          "ImageURL": "images/cb.7.jpg",
          "Description": "A look at the completed Rhino file."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Hexagonal Chess",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "The Needle Memorial",
      "BodyContent": "Responsive Mobile Environments",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Duke Chapel",
      "BodyContent": "Talk about how this was a complicated build but also looped in to a teaching component.",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "3D Modelling",
        "Laser Cutting",
        "Mini Makes",
        "Teaching"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Glowforge Cart",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Metalworking",
        "Woodworking",
        "3D Printing"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Kukanno Kami Figure",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Sadbear",
      "BodyContent": "Sadbear is a mix of a bear and a fish, and while such mash-ups usually create elegant mermaids, a mermaid Sadbear is not. It belongs to neither land nor sea, the fish tail offering no mobility out of water, and the top-heavy bear is unsuited to life underwater. Sadbear is lonely, having nowhere to belong, and he readily seeks companionship or any sort of connection. Sadbear is to be protected, and in uncertain times, the act of protecting another can be a point of stability for both Sadbear and the protector.\n<br><br>\nMaking Sadbear offered up new challenges compared to my other textile projects. First of all, it’s completely felt, and the edge-stitching without seam allowance was certainly different compared to working with woven fabrics, but my improvement can definitely be seen in the stitches. I found that felt allowed for really small and close stitches that had a very handmade yet almost antique quality, and I embraced some of that aesthetic with the satin-stitch nose and using buttons for eyes.\n<br><br>\nCombining the patterns for the bear and fish was also interesting, as they ended up meeting in a way that’s unintuitive on the paper patterns, and so I ended up completing the bear part and then measuring and adapting a mostly-sewn fish tail, which keeps a lot of of the process physical and in-the-moment, and was likely in part due to my comfort in patterning and adapting on the fly.\n<br><br>\nThe biggest time-sink of all was the tail. I think at least eight hours were spent on that tail alone, and while a lot was spent in the intersection of the two beasts, it ended up being mostly the tail fin. I wanted to add a wire so it would be slightly poseable, which meant it had to have two layers, and I kept the stitching as small as I could get it, but to reinforce those small details, I backed both sides with muslin. to keep the fin tight on the wire, I tacked the wire in place on the back side of the fin, and then once both halves were attached, I went over the wire with more stitches to make sure it was held down. What helped was that the wire was hand-twisted from smaller wire, so I was able to have gaps that I could run a needle and thread through the center, which just added extra stability so that it wouldn’t shift longitudinally.\n<br><br>\nIn the end, I’m happy with how Sadbear turned out, and while it was a whole lot of hand sewing, improving my sewing skills was kinda the point. I'd like to believe that my hand sewing became something I can depend on.",
      "Timeframe": {
        "Sortable": "2020-04-29",
        "Display": "April 2020"
      },
      "Description": "A protector and a companion",
      "ThumbnailImage": "images/sb.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Textiles"
      ],
      "Images": [
        {
          "ImageURL": "images/sb.1.jpg",
          "Description": "A view of the completed Sadbear."
        },
        {
          "ImageURL": "images/sb.2.jpg",
          "Description": "A view of the completed Sadbear."
        },
        {
          "ImageURL": "images/sb.3.jpg",
          "Description": "Sadbear's arms not only looked like they were asking for a hug, but could give a small one."
        },
        {
          "ImageURL": "images/sb.4.jpg",
          "Description": "A close up view of the detailed tail."
        },
        {
          "ImageURL": "images/sb.5.jpg",
          "Description": "My initial sketches for Sadbear. It was meant to look like a protector-coded knight, but the helmet would also help protect Sadbear from the sad world outside with a visor that it could use to literally shut out the world."
        },
        {
          "ImageURL": "images/sb.6.jpg",
          "Description": "The head starts taking shape. The ears were tricky to sew on since they were so small!"
        },
        {
          "ImageURL": "images/sb.7.jpg",
          "Description": "The body takes shape. Getting the arms to flip inside out afterwards was a challenge, the felt was just too stiff."
        },
        {
          "ImageURL": "images/sb.8.jpg",
          "Description": "The tail got sewn to the body directly with small stitches."
        },
        {
          "ImageURL": "images/sb.9.jpg",
          "Description": "The tail began in an embroidery hoop where the delicate felt would have some support. Look at those tight stitches!"
        },
        {
          "ImageURL": "images/sb.10.jpg",
          "Description": "The tail had to be made twice and the muslin was trimmed back. A wire was added to make the tail posable."
        },
        {
          "ImageURL": "images/sb.11.jpg",
          "Description": "The tail comes together."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Library Visitor",
      "BodyContent": "A tentacled beast raises a crustaceous limb, grasping at an oversized copy of Yayoi Kusama’s work. Clutching the book, it pulls its inflated, meatballish body further down the library stacks, where it continues to strain itself, curling tentacles wrapping around anything in its wake.\n<br><br>\nWhen Cora and I were paired up, we look at each other's work from a previous assignment and were tasked with combining them, placing a scaled-up version within a location at Hunt Library. We each had objects that we enjoyed and took elements from both projects and combined them. From my piece, we enjoyed my alien plant's unveiling of the simple muslin exterior, revealing the pop of color and pattern within. There’s a joyful mystery to it, and it draws the eye to the more exciting bits. There was also a dynamic aspect to the project, where a button on the back could be pulled to open and close the maw. This action became part of one of our tentacles that could curl with the pull of a string. From Cora's project we were inspired by the small feet. They gave the form life, and were a big inspiration in our final design. One of the first ideas we came up with was a mass of feet, and developed from there. Even though the form was amorphous, it still felt alive and seemed to belong to another world. We wanted our large inflatable to give off the same feeling. Funny enough, the sewn tentacles would at times grab nearby objects or chairs as we carried them.\n<br><br>\nWhile digging through the nylon scrap, we found a delightfully vivid and life-like tie dye fabric, almost like the skin of a crab or lobster, and knew we wanted to use it somehow. The white ripstop nylon that made up the creature’s body was in part a material consideration of the project, as it’s what we had the most of, and would contrast with the tie dye fabric. Because the tie dye was red and white, we chose to have additional, red blobs coming out of the form to indicate that they haven’t yet formed into full tentacles.\n<br><br>\nWe had an idea for situating our creature between the rows of books, that its bulbous form could be squished in the claustrophobic stacks. We decided that the main body would  be a sphere, but squished on the sides. We found a preexisting sphere pattern online, which called for six identical slices. We then altered the shape in Photoshop to expand the seams and made only five slices to create the main form. The resulting shape wasn’t quite sphere, but more flower-esque and organic.\n<br><br>\nOnly so much of the design could be done on paper, and so we moved into the physical realm of cutting, altering, and sewing. When creating the red blobs, we wanted them to feel organic. Instead of planning out how each would look, we let the forms take shape naturally as we fed the fabric through the sewing machine. It was a great exercise for moving forward when we dealt with the tentacles and larger blobs.\n<br><br>\nOur tentacle fabric was already pre-dyed and sewn up, so we had to make decisions on how to alter them, both to fit our aesthetic desires for a clean form with hidden seams, as well as to end with our desired tentacle tips. Making the tentacles dynamic was a process of trial and error, and we ended up doing a mix of organic discovery on the sewing machine and sewn ‘tendons’ that were pulled in to curl the tentacles, with a method similar to that of sewing a ruffle.\n<br><br>\nOnce we had our blobs and tentacles, we attached them to our slices. At this point, we had to figure out how much white space we wanted, and where we wanted our tentacles and blobs to be, and how they would be arranged. We ended up doing what felt balanced, and figured out what the fabric wanted to do, and where it wanted to be.\n<br><br>\nWe liked the idea of the creature being neither peaceful nor malevolent. By existing in both worlds, there’s a sense of ambiguity and uncanniness. It has the potential to harm and be disruptive (for instance by pushing books out of the stacks), but is also just confused and struggling to move through our world.\n<br><br>\nChoosing the stacks ended up being a great move, as the tentacles could latch onto and push through the bookshelves. The organic nature of these interactions cemented the creature in our world as a creature instead of a sculpture. Consequently, the inflatable looks best when photographed in and around bookshelves, which made it difficult to fully photograph, and didn’t feel quite right having it in the open against a backdrop.\n<br><br>\nIt was really interesting when the project was revealed to our classmates. People would touch the tentacles sitting atop or coming through the shelves, and many compared it to a monster or a parasite that could hurt someone. However, when asked by our teacher, nobody actually said that it scared them. The form might have uncomfortable aspects, but the inflatable nature and cartoonish aspect of it looking stuck make it more silly. Plus, it loudly announces its presence with the fan that keeps it inflated, and it’s in a brightly lit environment, so it won’t be sneaking up on anyone.\n<br><br>\nOur final piece succeeded in fitting into the world of the mushroom blob, and the two pieces provide more of a view into the world they come from. It would be exciting to see more of the creatures and artifacts of that world, and how they interact in their natural environment. \n<br><br>\nOverall, our project was successful. As its creators, we wanted the form to be fun and live in between the contexts of the library and that other world. If we were to continue working on this, we’d look into moving it into other spaces where it could be more in the way, adapting its form to further bother people and clumsily disrupt them.",
      "Timeframe": {
        "Sortable": "2020-03-09",
        "Display": "March 2020"
      },
      "Description": "A strange alien creature visits a library",
      "ThumbnailImage": "images/lv.thumbnail.jpg",
      "Collaborators": [
        {
          "Name": "Cora Hickoff",
          "Role": ""
        }
      ],
      "Tags": [
        "Textiles"
      ],
      "Images": [
        {
          "ImageURL": "images/lv.5.jpg",
          "Description": "The completed inflatable before being installed on site."
        },
        {
          "ImageURL": "images/lv.6.jpg",
          "Description": "The library visitor in the stacks."
        },
        {
          "ImageURL": "images/lv.7.jpg",
          "Description": "A detail shot of the library visitor."
        },
        {
          "ImageURL": "images/lv.8.jpg",
          "Description": "A scenic shot of the library visitor."
        },
        {
          "ImageURL": "images/lv.9.jpg",
          "Description": "A shot of the library visitor."
        },
        {
          "ImageURL": "images/lv.10.jpg",
          "Description": "A shot of people approaching the library visitor."
        },
        {
          "ImageURL": "images/lv.11.jpg",
          "Description": "A shot of people interacting with the library visitor."
        },
        {
          "ImageURL": "images/lv.12.jpg",
          "Description": "A shot of people interacting with the library visitor."
        },
        {
          "ImageURL": "images/lv.13.jpg",
          "Description": "A shot of the library visitor."
        },
        {
          "ImageURL": "images/lv.14.jpg",
          "Description": "A detail shot of the library visitor."
        },
        {
          "ImageURL": "images/lv.15.jpg",
          "Description": "A shot of the library visitor."
        },
        {
          "ImageURL": "images/lv.16.jpg",
          "Description": "A detail shot of the library visitor."
        },
        {
          "ImageURL": "images/lv.17.jpg",
          "Description": "A detail shot of the library visitor."
        },
        {
          "ImageURL": "images/lv.18.jpg",
          "Description": "A detail shot of the library visitor."
        },
        {
          "ImageURL": "images/lv.19.jpg",
          "Description": "A detail shot of the library visitor."
        },
        {
          "ImageURL": "images/lv.20.jpg",
          "Description": "A detailshot of the library visitor."
        },
        {
          "ImageURL": "images/lv.1.jpg",
          "Description": "To get our basic pattern for the body, we had to use a large sheet of butcher paper and a classroom's projector."
        },
        {
          "ImageURL": "images/lv.2.jpg",
          "Description": "We then had to trace and cut the pattern out of ripstop."
        },
        {
          "ImageURL": "images/lv.3.png",
          "Description": "The tentacles and growths were added to the panels before they were all assembled."
        },
        {
          "ImageURL": "images/lv.4.png",
          "Description": "Our test inflation after everything was sewn together."
        },
        {
          "ImageURL": "images/lv.21.jpg",
          "Description": "My alien egg that we took inspiration from."
        },
        {
          "ImageURL": "images/lv.22.jpg",
          "Description": "My alien egg that we took inspiration from."
        },
        {
          "ImageURL": "images/lv.23.jpg",
          "Description": "Cora's mushroom blob that we took inspiration from."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Heat Gun Doppelganger",
      "BodyContent": "I took my trusty heat gun and copied it at a rough 2:1 scale. I chose my heat gun because it’s a tool that I used in cosplay work, taking flat sheets of foam and cutting it based on a pattern and heat-forming curves, a process nearly identical to that of copying the tool itself. It’s the tool that got me familiar with patterning and forming shapes to the human body. It was difficult taking such a geometric yet fluid and ergonomic shape and changing that into flat pattern pieces. As I went, I ended up taking out more and more minute details that at first I thought I’d be able to capture due to the difficulties of scale and having it show up in the final product, like taking out some of the fine detail in the handle and towards the bottom of the grip.\n<br><br>\nThe fabric choice was intended to capture the tool as it is in life. The yellow plastic of the heat gun is softer and more friendly to the hand, while the black is harder and more durable, hence the treated denim material. The hot end evokes heat and the metallic shine, and the sequins give it a distinct texture.\n<br><br>\nIn turning the taped object into pattern pieces, I ended up having to re-draw the pattern in CAD anyways to scale it up, so I decided to use that to laser cut my fabric as well. In the future, I’ll have to use some sort of dotted line or light score to mark the sew line, as in the end I had to go back and re-draw those anyways, having cut the seam allowance, and the pen I used marking those ended up bleeding through the felt. However, it does give it more of a crafted look and less like a finished and polished piece, which is fitting for a practical tool.\n<br><br>\nI’m happy with the final product, and it was a fun working with the tape-pattern process that I’d only used for foam before. the materials certainly have different pattern considerations, which is something to remember. For example, foam is edge-glued, and doesn’t have a seam allowance.",
      "Timeframe": {
        "Sortable": "2020-03-21",
        "Display": "March 2020"
      },
      "Description": "One of my favorite tools is the humble heat gun",
      "ThumbnailImage": "images/hg.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Textiles"
      ],
      "Images": [
        {
          "ImageURL": "images/hg.1.jpg",
          "Description": "The doppelganger and the heat gun."
        },
        {
          "ImageURL": "images/hg.2.jpg",
          "Description": "The doppelganger and the heat gun."
        },
        {
          "ImageURL": "images/hg.3.jpg",
          "Description": "The doppelganger was pretty unwieldy compared to a heat gun."
        },
        {
          "ImageURL": "images/hg.4.jpg",
          "Description": "It looks a bit like an oversized sci-fi ray gun or phaser."
        },
        {
          "ImageURL": "images/hg.5.jpg",
          "Description": "The felt was laser cut after I digitized the pattern I got by wrapping the heat gun in tape and then cutting those. I had to go back and draw the seam allowance anyways."
        },
        {
          "ImageURL": "images/hg.6.jpg",
          "Description": "Sewing the parts together."
        },
        {
          "ImageURL": "images/hg.7.jpg",
          "Description": "A very yellow image."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Alien Plant",
      "BodyContent": "PLUSH FROM INFLATABLES",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Inflatable Studies",
      "BodyContent": "The colorful guys",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Blue Pencil Box",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Head in the Clouds",
      "BodyContent": "This project was designed as an installation to go into Pittsburgh International Airport. The immersive installation enables airport travelers to experience a personal and connective LED adventure. The team wanted each person to experience a unique world when they entered the box, but be drawn into the individual world by LED shadows from all of the boxes in the atrium.\n<br><br>\nThe individual experience is unique for the installation. The user has to almost duck into a hanging box, and, when he or she is head enters the box, the LED's glow underneath a blanket of cloud-like material. The “cloud” material diffuses the light into an enthralling glow, and allows for the wave of LED colors to flow around the material. The typical colors are soft blues and purples that are capturing and soothing. The user can experience this in anyway, but the team imagined the internal installation as a wave of clouds that envelop the user. \n<br><br>\nThe entire installation would have multiple boxes hanging at different head levels around the atrium. They would be incorporated directly into the floor plan, so travelers can directly interact with the installation. The different heights of the boxes allow anyone to interact with the installation no matter the height of the person. The installation could be compared to small, pop-up kiosks or information panels; however, the installations will be personal LED experiences rather than information or items being sold.\n<br><br>\nThe outside of the installation is a mysterious, engaging element that dims the LEDs, and emits a soft shadow of the lights on the surrounding ground.\n<br><br>\nThe structure of the box are acrylic panels which allow for light to pass throughout the structure. Thus, the outside of the box was covered in the same material as the inside of the box to diffuse light, but also engage travelers.  This allows for users to touch and look at a dulled experience before entering the immersed, cloud world.\n<br><br>\nThis makes travelers interested on the contents of the glowing “box”, and interact with the installation more. However, if the travelers don’t want to be immersed in their own cloud world, the soft glow of the installations add passive, cheerful color to the travelers’ days.\n<hr>\n<iframe width=\"560\" height=\"315\" src=\"https://www.youtube.com/embed/jglsFZPmXO8?si=rJE96NrhGtORPavW\" title=\"YouTube video player\" frameborder=\"0\" allow=\"accelerometer; autoplay; clipboard-write; encrypted-media; gyroscope; picture-in-picture; web-share\" referrerpolicy=\"strict-origin-when-cross-origin\" allowfullscreen></iframe><hr>\nThe team's thought process throughout the design changed dramatically. The vessel to deliver the clouds changed a lot, even though we wanted to keep the idea of a cloud-based structure. \n<br><br>\nThe team initially was thinking of an abstract arch that proudly displayed the clouds. We wanted the structure to alter color by physically changing tension throughout the structure. However, the team deemed the arch as childish, and the physical manipulation of the structure was too hard to prototype.\n<br><br>\nThe team briefly thought of hanging the cloud \"boxes\" or individual structures from the ceiling, but we thought the structure would be too far away from airport travelers to interact with the technology and installation. However, we transitioned the box structures from the ceiling to human head-level. This allowed direct interaction with installation, and a unique take on LED's and architecture. \n<br><br>\nThe outside of the final idea changed the most during the process. We initially wanted the outside of the structure to be a clouded acrylic box that diffused the light. However, due to material and construction constraints, the team decided to emulate the inside of the box to flow onto the outside of the box. This allowed maximum diffusion of the LED's on the outside, and acted as a \"pull\" to travelers to touch and look at the installation.",
      "Timeframe": {
        "Sortable": "2019-10-12",
        "Display": "October 2019"
      },
      "Description": "An immersive LED experience that captures and enthralls travelers in a cloud-based environment. ",
      "ThumbnailImage": "images/hic.thumbnail.jpg",
      "Collaborators": [
        {
          "Name": "Russell Orlick",
          "Role": ""
        },
        {
          "Name": "Alex Wang",
          "Role": ""
        },
        {
          "Name": "Elizabeth Han",
          "Role": ""
        }
      ],
      "Tags": [
        "Programming",
        "Laser Cutting"
      ],
      "Images": [
        {
          "ImageURL": "images/hic.1.jpeg",
          "Description": "An atmospheric shot of the final installation."
        },
        {
          "ImageURL": "images/hic.2.jpeg",
          "Description": "An atmospheric shot of the final installation."
        },
        {
          "ImageURL": "images/hic.3.jpeg",
          "Description": "Russell looks up into the cloud."
        },
        {
          "ImageURL": "images/hic.4.jpeg",
          "Description": "I experience the cloud."
        },
        {
          "ImageURL": "images/hic.5.jpeg",
          "Description": "A look into the cloud."
        },
        {
          "ImageURL": "images/hic.6.jpg",
          "Description": "It started as a laser cut acrylic box."
        },
        {
          "ImageURL": "images/hic.7.jpg",
          "Description": "The clear acrylic made for some cool reflections! Too bad they've be covered up by cotton."
        },
        {
          "ImageURL": "images/hic.8.jpg",
          "Description": "The cotton helped diffuse the lighting and added depth, literally and figuratively."
        },
        {
          "ImageURL": "images/hic.9.gif",
          "Description": "A first test of the lights."
        },
        {
          "ImageURL": "images/hic.10.jpg",
          "Description": "With the lights on it loses most of its presence."
        },
        {
          "ImageURL": "images/hic.11.jpg",
          "Description": "A detail shot of the cloud."
        },
        {
          "ImageURL": "images/hic.12.jpg",
          "Description": "A behind-the-scenes shot of what our documentation process looked like."
        },
        {
          "ImageURL": "images/hic.13.jpg",
          "Description": "The installation gets presented."
        },
        {
          "ImageURL": "images/hic.14.jpg",
          "Description": "In the background you can see part of our TouchDesigner script."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Mycelium",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Antiquarian Photography",
      "BodyContent": "Maybe split these into multiple projects?",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Printmaking"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Molded Dagger Handle",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "The Redding Sword",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Arcanotech Jumper Cables",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "FiDO",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Walpurgisnacht Ukulele",
      "BodyContent": "Can talk about the workholding aspect and the trust you gotta have in yourself",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Anime",
        "Laser Cutting",
        "Mini Makes"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Pittsburgh Map",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Monhegan Map",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "The Whalesong",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Fancy Cup Holder",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Digital Lantern",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Sewing Station DELETE ME",
      "BodyContent": "Co-Lab Sewing Station",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "LARP Dagger Holder",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Eggue",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Steampunk Revolver",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Ego",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "LARP Greaves",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Maine Penitentiary Pencil Case",
      "BodyContent": "Everyone starts somewhere. I didn't know how to laser cut before coming to college, and this here happens to be the project where I learned just that.\n<br><br>\nMy family had recently gone on a family vacation to Maine and we had stopped by the Maine State Prison Showroom, where goods produced by the inmates were being displayed and sold. I saw this really nice pencil case and thought it would make for a great gift for my partner, who was an artist. I asked her to design a celtic knot pattern that I could use for some projects, and from that we get the drawing shown. I took it into Rhino and adapted it to something that would tile well and took measurements of the pencil case, adjusting my design to fit on all six sides. It was just a couple of days after the school year had started, and I knew I had access to a makerspace in Hunt library so I went in and asked the staff member there for help.\n<br><br>\nThat person just so happened to be Cody Soska, who was basically the makerspace technician for all of IDeATe, and we'd end up being great maker friends, especially after I graduated and took up a similar role as him. In a way, he was my inspiration to learn how to help others, but that's getting a bit ahead of myself. But man, that takes me back.\n<br><br>\nCody took his time carefully explaining how to use the laser and helped me figure out how to perfectly align my file and material, focus the laser, and run the file. He helped me try and engrave the two ends even though it became clear it would be too tall for the laser. I don't remember if he helped me for thirty minutes or an hour, but that short amount of time left a lasting impression that would forever change the trajectory of my life. I think after that point, I truly became a maker, and that impression, the impact of discovering the joy of making, would be something that I would try to pay back to the community a hundredfold.",
      "Timeframe": {
        "Sortable": "2017-08-27",
        "Display": "August 2017"
      },
      "Description": "\"Hello World\"",
      "ThumbnailImage": "images/mpc.thumbnail.jpg",
      "Collaborators": [
        {
          "Name": "Raven Hughes",
          "Role": "Designer"
        }
      ],
      "Tags": [
        "Laser Cutting",
        "Mini Makes"
      ],
      "Images": [
        {
          "ImageURL": "images/mpc.1.jpg",
          "Description": "The finished pencil case."
        },
        {
          "ImageURL": "images/mpc.2.jpg",
          "Description": "The bottom of the finished pencil case."
        },
        {
          "ImageURL": "images/mpc.3.jpg",
          "Description": "The celtic knot pattern my partner designed."
        },
        {
          "ImageURL": "images/mpc.4.jpg",
          "Description": "A behind-the-scenes view of the file coming together in Rhino."
        }
      ],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Firefly Jar",
      "BodyContent": "<a href=\"linkedScripts/fireflyJar.js\" target=\"_blank\" rel=\"noopener noreferrer\">Project Source Code</a>\n<iframe src='linkedScripts/fireflyJar.html' width='100%' height='500px' frameborder='0'></iframe>\n<p>I’ve done projects making “flying bugs in a jar” before, and I decided it would be a good time to try and make one with turtles. Getting the turtle to stay inside the jar was more challenging that I expected, mostly because of the way I made the turtle move. However, it responds to the cursor while it’s inside the jar. If I wanted to expand on this project, I would have multiple fireflies in the jar that have some level of collision so that they could act like a swarm.\n<br><br>\nFor reference, turtles are Objects that can move forwards, backwards, and turn. So the firefly isn't being moved around directly by X and Y axis manipulations.\n</p>",
      "Timeframe": {
        "Sortable": "2018-11-09",
        "Display": "November 2018"
      },
      "Description": "It's technically a turtle",
      "ThumbnailImage": "images/fj.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Programming"
      ],
      "Images": [],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Mountain Roads",
      "BodyContent": "<a href=\"linkedScripts/mountainRoad.js\" target=\"_blank\" rel=\"noopener noreferrer\">Project Source Code</a>\n<iframe src='linkedScripts/mountainRoad.html' width='100%' height='500px' frameborder='0'></iframe>\n<p> This project was inspired by long car rides through the mountains. Every year I'd make the drive twice - once to move into college and once to move out. I sketched up an idea that involved cars going different directions, but after implementing the moving mountains, I realized I had to simplify my idea. I kept the most important part of that, the mountains, and rebuilt from there. I think having all the layers as parallax helps add some measurable scale to the mountains and trees in the background. Making the objects got tedious, but once I had one and understood how the pieces fit together, it really sped up from there.\n<br><br>\nI’m really satisfied with how it turned out. Staring at it is just like looking out the window of a car on a long drive!</p>\n\n\nCould talk about the drive to and from Pittsburgh each year, and how this was a Generative Landscape as well as how it was an exploration into parallax.",
      "Timeframe": {
        "Sortable": "2018-10-31",
        "Display": "October 2018"
      },
      "Description": "Inspired by my drive back home",
      "ThumbnailImage": "images/mr.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Programming"
      ],
      "Images": [],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Abstract clock",
      "BodyContent": "<a href=\"linkedScripts/abstractClock.js\" target=\"_blank\" rel=\"noopener noreferrer\">Project Source Code</a>\n<iframe src='linkedScripts/abstractClock.html' width='100%' height='500px' frameborder='0'></iframe>\n<p>Orbit clocks are cool with their circles inside circles, but they’re easy to read and overdone, so I made a clock where each unit orbits the next highest one. The centermost one is hours, orbited by minutes, orbited by seconds, orbited by milliseconds.\n<br><br>\nIt was quite a challenge putting this together, as some arrays were being really finnicky, so even though the hours, minutes, seconds, and milliseconds could have been one operation on an array, I had to brute-force it. However, what would a space-y clock be without some twinkling stars!\n<br><br>\nAs far as clocks go, I like how this ended up looking, even though it would take more effort than I’d be willing to put in to read. </p>",
      "Timeframe": {
        "Sortable": "2018-10-04",
        "Display": "October 2018"
      },
      "Description": "A clock in the form of celestial bodies",
      "ThumbnailImage": "images/ac.thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Programming"
      ],
      "Images": [],
      "Complete": true,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Parametric Flower",
      "BodyContent": "Creative computing, talk about how this was similar to what I might do in Grasshopper/Rhino.",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Consumables Tracker",
      "BodyContent": "Duke spreadsheet",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Programming",
        "Makerspace Improvements",
        "Technical"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Roots Workshops",
      "BodyContent": "Teaching at Duke",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Teaching",
        "Makerspace Improvements"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Wilson Lab Makerspace",
      "BodyContent": "Collab with Tobey",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Makerspace Improvements",
        "Architecture"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Co-Lab Doorway proposal",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "Co-Lab Uvula Proposal",
      "BodyContent": "Kinda did get implemented",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Default Tag"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    },
    {
      "Title": "ISEKAI Foundry Implementation",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Gaming",
        "Programming",
        "TTRPG",
        "Big Builds"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "ISEKAI TTRPG",
      "BodyContent": "Talk about game design, project management, hiring, coordinating a team of artists, marketing",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Game Design",
        "TTRPG",
        "Anime",
        "Technical",
        "Big Builds"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Previous Portfolio Website",
      "BodyContent": "<p>New project content in HTML format.</p>",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Programming",
        "Technical"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "This Website",
      "BodyContent": "Talk about what I learned making the old portfolio website and how I wanted to restructure it with a more programmatic approach. Also how I built backend tools like the markdown-editor and thought about structuring my images, and is generally more capable as a living webpage that I can continuously edit. It was \"started\" on Nov 2nd and acknowledge that it was made with ChatGPT",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Programming",
        "Technical"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Scrap Ecosystem",
      "BodyContent": "Co-Lab, talk about scrap cart and under shopbot storage as well as flat storage.",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Makerspace Improvements"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Screenprinting in the Digital Era",
      "BodyContent": "My final roots class",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Printmaking",
        "Teaching",
        "Laser Cutting"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": false
    },
    {
      "Title": "Zenith Larp",
      "BodyContent": "Talk about how I didn't make the system, but I did get to add content and runs plot for while. Also talk about how it introduced me to LARP in the first place and maybe how I got to design ARGs and props and costuming with aspects of project planning, meeting with a team and it used one of my hobbies - wandering around campus aimlessly. But yeah I made the advanced book, a bestiary, and our player repository, and remaking the item system.",
      "Timeframe": {
        "Sortable": "",
        "Display": "Month Year"
      },
      "Description": "A brief description of the new project.",
      "ThumbnailImage": "images/default-thumbnail.jpg",
      "Collaborators": [],
      "Tags": [
        "Game Design",
        "LARP"
      ],
      "Images": [
        {
          "ImageURL": "images/default-image.jpg",
          "Description": "Default image description."
        }
      ],
      "Complete": false,
      "Favorite": false,
      "Hidden": true
    }
  ]
}